Repository: psoetens/orocos-www
Catalog: drupal/sites/all/modules/tableofcontents/po/*.po
Languages: fr

source: A module to create named anchors based on HTML headings.
fr: Un module qui ajoute des ancres nommées aux balises de titre HTML.

source: Every instance heading tags will be modified to include an id attribute for anchor linking.
fr: Chaque balise de titre sera modifiée pour comporter un attribut id dans le but de pouvoir recevoir un lien.

source: Insert heading anchors automatically.
fr: Ajouter automatiquement des ancres aux titres.

source: Headings to Anchors
fr: Titres vers ancres

source: Inserts named anchors for heading tags automatically.
fr: Ajoute automatiquement des ancres nommées aux balises de titre.

source: headinganchors
fr: ancresdetitre

source: A module to create a table of contents based on HTML header tags. Changes headers to anchors for processing so it may be incompatible with other filters that process header tags. It does use existing IDs on the header tags if already present and only operates on header levels 1 - 6.
fr: Un module qui génère une table des matières en se basant sur les balises de titre HTML. Change les titres en leur ajoutant des ancres pour effectuer un traitement, donc pourrait être imncompatible avec d'autres filtres effectuant également un traitement sur les balises de titre. Réutilise les attributs id des balises de titre déjà existants et agit seulement sur les titres de niveau 1 à 6.

source: Every instance of "&lt;!--tableofcontents--&gt;" in the input text will be replaced with a collapsible mediawiki-style table of contents. Accepts options for title, list style, minimum heading level, and maximum heading level, and attachments as follows: &lt;!--tableofcontents list: ol; title: Table of Contents; minlevel: 2; maxlevel: 3; attachments: yes;--&gt;. All arguments are optional.
fr: Chaque apparition de "&lt;!--tableofcontents--&gt;" dans le texte sera remplacée par une table des matières déroulable de style MediaWiki. Accepte des options pour le titre, le type de liste, le niveau de titre minimum et maximum, et les fichiers attachés, et ce comme suit: &lt;!--tableofcontents list: ol; title: Table of Contents; minlevel: 2; maxlevel: 3; attachments: yes;--&gt;. Tous les arguments sont optionnels.

source: Every instance of "&lt;!--tableofcontents--&gt;" in the input text will be replaced with a collapsible mediawiki-style table of contents.
fr: Chaque apparition de "&lt;!--tableofcontents--&gt;" dans le texte sera remplacée par une table des matières déroulable de style MediaWiki.

source: Insert &lt;!--tableofcontents [list: ol; title: Table of Contents; minlevel: 2; maxlevel: 3; attachments: yes;]--&gt; to insert a mediawiki style collapsible table of contents. Arguments within [] are optional.
fr: Insérer &lt;!--tableofcontents [list: ol; title: Table of Contents; minlevel: 2; maxlevel: 3; attachments: yes;]--&gt; pour faire afficher une table des matières déroulable de style MediaWiki. Les arguments à l'intérieur de [] sont optionnels.

source: Insert &lt;!--tableofcontents--&gt; to insert a mediawiki style collapsible table of contents.
fr: Insérer &lt;!--tableofcontents--&gt; pour faire afficher une table des matières déroulable de style MediaWiki.

source: Table of Contents
fr: Table des matières

source: Inserts a table of contents in the place of &lt;!--tableofcontents--&gt; tags.
fr: Insère une table des matières à la place des balises &lt;!--tableofcontents--&gt;.

source: !attachments is an invalid attachments option. Attachments option must be set to '1' to display or '0' to hide.
fr: !attachments est une option invalide pour les fichiers attachés. L'option pour les fichiers atatchés doit être paramétrée à '1' pour l'affichage ou à '0' pour le masquage.

source: Allow users to override these settings within the &lt;!--tableofcontents--&gt; tag
fr: Permet aux utilisateurs de supplanter ces configurations à l'intérieur de la balise &lt;!--tableofcontents--&gt;

source: Remove Table of Contents tags from teasers
fr: Supprime dans les résumés les balises pour la table des matières

source: If this setting is changed, each node may need to be re-edited to reflect the new setting. This will also cause every node with a Table of Contents to have a split teaser. If you have many nodes, the <a href="@retease">Retease module</a> can help to do this automatically.
fr: Si cette configuration est modifiée, chaque noeud peut nécessiter une réédition pour que la nouvelle configuration soit prise en compte. Cela fera aussi en sorte que chaque noeud comportant une table des matières aura un résumé à part. Si vous avez plusieurs noeuds, le <a href="@retease">module Retease</a> peut le faire pour vous automatiquement.

source: Table of Contents Title
fr: Titre pour la table des matières

source: Enter a default title for each Table of Contents. This will be translated for each individual page.
fr: Entrer un titre par défaut pour chaque table des matières. Ce sera traduit pour chaque page.

source: List Type
fr: Type de liste

source: Ordered list
fr: Liste ordonnée

source: Unordered list
fr: Liste non ordonnée

source: Minimum heading level
fr: Niveau de titre minimum

source: Show attachments in the table of contents
fr: Affiche les fichiers attachés dans la table des matières

source: Your summary was split from the body as site settings don't allow Table of Contents in summaries.
fr: Votre résumé a été séparé du corps du message étant donné que la configuration du site ne permet pas d'avoir une table des matières dans les résumés.

source: A split summary was automatically created as site settings don't allow Table of Contents in summaries.
fr: Un résumé à part du corps du message a été automatiquement créé étant donné que la configuration du site ne permet pas d'avoir une table des matières dans les résumés.

source: hide
fr: masquer

source: Attachments
fr: Fichiers attachés

source: tableofcontents
fr: tabledesmatieres

source: Heading anchors
fr: Ancres de titre

source: Filter that marks H2 and H3 headings with id anchors from which Tables of Contents can be generated.
fr: Filtre qui ajoute aux titres H2 et H3 des ancres id à partir desquelles la table des matières peut être générée.

source: Input Filters
fr: Filtres d'entrée

source: Adds a filter that generates Tables of Contents for pages marked with '&lt;!--tableofcontents--&gt;'.
fr: Ajoute un filtre qui génère une table des matières pour les pages comporant un '&lt;!--tableofcontents--&gt;'.

source: show
fr: afficher
