Repository: psoetens/orocos-www
Catalog: drupal/sites/all/modules/tableofcontents/translations/*.po
Languages: fr, pl

source: Table of Contents
fr: Table des matières
pl: Spis treści

source: This filter adds a table of contents referencing headers found in a node. If no headers are defined in the node content, then no table of content is added (whether or not a [toc ...] is defined.)
fr: Ce filtre ajoute une table des matières formée des titres trouvés dans un noeud. Si aucun titre n'est présent dans le corps du noeud, aucune table des matières n'est ajoutée (peu importe si une balise [toc ...] est présente ou non).

source: Hide the table of contents tags
fr: Cacher les balises de la table des matières

source: Whether an automatic table of content should be added
fr: Ajout ou non automatique de la table des matières

source: Do not automatically add a table of content
fr: Ne pas ajouter automatiquement de table des matières

source: If no [toc ...], automatically add one at the top of the page
fr: Si aucune balise [toc ...], ajouter automatiquement une table dans le haut de la page

source: If no [toc ...], automatically add one at the bottom of the page
fr: Si aucune balise [toc ...], ajouter automatiquement une table dans le bas de la page

source: Please, note that there is a minimum limit (see below) that needs to be reached for the table of content to be added.
fr: Prendre note qu'un seuil minimal (voir ci-dessous) doit être atteint pour que la table des matières soit ajoutée.

source: Number of headers before an automatic table of content is added
fr: Nombre de titres pour qu'une table des matières soit ajoutée automatiquement

source: When no [toc ...] is defined and the automatic feature is turned on, a table of contents will automatically be added only if at least that many headers are present.
fr: Lorsqu'aucune balise [toc ...] n'est présente et que la fonction d'ajout automatique est activée, une table des matières sera automatiquement ajoutée seulement si le nombre donné de titres est atteint.

source: Allow users to override the settings within the table of contents tag itself
fr: Permet aux utilisateurs de supplanter la configuration dans la balise de la table des matières

source: Remove Table of Contents tags from teasers
fr: Supprime dans les résumés les balises de la table des matières

source: If this setting is changed, each node may need to be re-edited to reflect the new setting. This will also cause every node with a Table of Contents to have a split teaser. If you have many nodes, the <a href="@retease">Retease module</a> can help to do this automatically, except if you also want to use the automatic table of content feature which requires the addition of [toc hide:1] in your teaser.
fr: Si cette configuration est modifiée, chaque noeud peut nécessiter une réédition pour que la nouvelle configuration soit prise en compte. Ceci fera également en sorte que chaque noeud comportant une table des matières aura un résumé à part. Si vous avez plusieurs noeuds, le <a href="@retease">module Retease</a> peut le faire pour vous automatiquement, sauf si vous désirez aussi utiliser la fonction d'ajout automatique de la table des matières, qui requiert alors l'ajout de [toc hide:1] dans votre résumé.

source: Table of Contents Title
fr: Titre de la table des matières

source: Enter a default title for each Table of Contents. This will be translated for each individual page.
fr: Entrer un titre par défaut pour chaque table des matières. Ce sera traduit pour chaque page.

source: List Type
fr: Type de liste

source: Ordered list
fr: Liste ordonnée

source: Unordered list
fr: Liste non ordonnée

source: Minimum heading level
fr: Niveau de titre minimum

source: Maximum heading level
fr: Niveau de titre maximum

source: Show attachments in the table of contents
fr: Affiche les fichiers attachés dans la table des matières

source: Include link to hide/show table of contents
fr: Ajouter un lien pour masquer/afficher la table des matières

source: Start with the table of content collapsed
fr: Table des matières masquée par défaut

source: Back to top label
fr: Retour à l'ancre de début

source: The message to display at the bottom of each paragraph with a link back to the table of contents. Leave empty to avoid this link.
fr: Le message à afficher à la suite de chaque paragraphe, avec un lien vers la table des matières. Laisser vide pour désactiver cette option.

source: Scroll back to the table of contents
fr: Défilement jusqu'à la table des matières

source: Use the local scroll with jquery to scroll back to the table of contents.
fr: Utilise Local-Scroll avec jquery pour defiler jusqu'à la table des matières.

source: Numbering method
fr: Type de numérotation

source: No number
fr: Aucun nombre

source: Numbers 1., 2., 3. (like <ol>)
fr: Nombres: 1., 2., 3. (comme <ol>)

source: Sub-numbers 1., 1.1, 1.2, 2., 2.1, 2.2, etc.
fr: Sous-nombres: 1., 1.1, 1.2, 2., 2.1, 2.2, etc.

source: Sub-numbers with zero 1.0, 1.1, 1.2, 2.0, 2.1, 2.2, etc.
fr: Sous-nombres avec un zéro: 1.0, 1.1, 1.2, 2.0, 2.1, 2.2, etc.

source: Select the type of numbering.
fr: Sélectionner le type de numérotation.

source: Add the number to the headers
fr: Ajouter le nombre aux titres

source: Also add the numbers shown in the table of contents to the headers.
fr: Ajouter également aux titres les nombres affichés dans la table des matières.

source: Numbering mode
fr: Style de numérotation

source: Decimal (1, 2, 3...)
fr: Chiffres arabes (1, 2, 3...)

source: Roman (I, II, III, ...)
fr: Chiffres romains majuscules (I, II, III...)

source: Roman (i, ii, iii, ...)
fr: Chiffres romains minuscules (i, ii, iii...)

source: Letters (A, B, C, ...)
fr: Lettres majuscules (A, B, C...)

source: Letters (a, b, c, ...)
fr: Lettres minuscules (a, b, c...)

source: Select decimal, roman, or letters.
fr: Sélectionner le style de numérotation (chiffres arabes, chiffres romains ou lettres).

source: Numbering prefix
fr: Préfixe de la numérotation

source: The characters added at the start. Often used for an opening parenthesis.
fr: Le ou les caractères ajoutés au début. Usage fréquent: une parenthèse ouvrante.

source: Numbering separator
fr: Séparateur de la numérotation

source: The characters added between each number.
fr: Le ou les caractères ajoutés entre chaque nombre.

source: Numbering suffix
fr: Suffixe de la numérotation

source: The characters added at the end. Often used for a closing parenthesis.
fr: Le ou les caractères ajoutés à la fin. Usage fréquent: une parenthèse fermante.

source: The content you saved contains a table of contents. A separate summary (teaser) has been automatically created without the table of contents at the top. If you make any further changes, be sure to check the summary field to see if your changes apply there as well.
fr: Le contenu sauvegardé contient une table des matières. Un résumé séparé a été automatiquement créé sans table des matières dans le haut. Si vous modifiez ultérieurement le contenu, n'oubliez pas, le cas échéant, de mettre également à jour le résumé.

source: The summary (teaser) was automatically split from the body as site settings does not allow table of contents in summaries. If you make any further changes, be sure to check the summary field to see if your changes apply there as well.
fr: Le résumé a été séparé automatiquement du corps du message étant donné que la configuration du site ne permet pas d'avoir une table des matières dans les résumés. Si vous modifiez ultérieurement le contenu, n'oubliez pas, le cas échéant, de mettre également à jour le résumé.

source: Table of contents error: !opt is not a valid boolean value for hidden. Expected 0, false, 1, or true.
fr: Erreur concernant la table des matières: !opt n'est pas une valeur booléenne valide pour l'argument hidden. Valeur attendue: 0, false, 1 ou true.

source: Table of contents error: !opt is not a valid list type. Expected 'ul', 'unordered', 'ol', or 'ordered'
fr: Erreur concernant la table des matières: !opt n'est pas un type de liste valide. Valeur attendue: ul, unordered, ol ou ordered

source: Table of contents error: !opt is not a valid level. Expected a number from 1 to 6
fr: Erreur concernant la table des matières: !opt n'est pas un niveau valide. Valeur attendue: un nombre entre 1 et 6

source: Table of contents error: !opt is not a valid boolean value for attachment. Expected 0, false, 1, or true.
fr: Erreur concernant la table des matières: !opt n'est pas une valeur booléenne valide pour l'argument attachment. Valeur attendue: 0, false, 1 ou true.

source: Table of contents error: !opt is not a valid boolean value for hideshow. Expected 0, false, 1, or true.
fr: Erreur concernant la table des matières: !opt n'est pas une valeur booléenne valide pour l'argument hideshow. Valeur attendue: 0, false, 1 ou true.

source: Table of contents error: !opt is not a valid boolean value for collapsed. Expected 0, false, 1, or true.
fr: Erreur concernant la table des matières: !opt n'est pas une valeur booléenne valide pour l'argument collapsed. Valeur attendue: 0, false, 1 ou true.

source: Table of contents error: !opt is not a valid option.
fr: Erreur concernant la table des matières: !opt n'est pas une option valide.

source: Table of contents error: minlevel (!minlevel) is larger than maxlevel (!maxlevel), reverting to defaults.
fr: Erreur concernant la table des matières: le niveau minimum des titres (!minlevel) est plus grand que le niveau maximum (!maxlevel); la configuration par défaut sera utilisée.

source: show
fr: afficher
pl: pokaż

source: hide
fr: masquer
pl: ukryj

source: Attachments
fr: Fichiers attachés
pl: Załączniki

source: A module to create a table of contents based on HTML header tags. Changes headers to anchors for processing so it may be incompatible with other filters that process header tags. It does use existing IDs on the header tags if already present and only operates on header levels 1 - 6.
fr: Un module qui génère une table des matières en se basant sur les balises de titre HTML. Change les titres en leur ajoutant des ancres pour effectuer un traitement, donc pourrait être incompatible avec d'autres filtres effectuant également un traitement sur les balises de titre. Réutilise les attributs id des balises de titre déjà existants et agit seulement sur les titres de niveau 1 à 6.
pl: Moduł tworzy spis treści w obrębie danego węzła bazujący na tagach HTML nagłówków. Zmiana nagłówków na zakotwiczenia może być niekompatybilna z innymi filtrami modyfikującymi nagłówki. Moduł używa istniejących pól ID jako oznaczenie nagłówków (o ile istnieją) i osbługuje nagłówki w poziomach 1 - 6.

source: Every instance of "[toc ...]" in the input text will be replaced with a collapsible mediawiki-style table of contents. Accepts options for title, list style, minimum heading level, and maximum heading level, and attachments as follows: [toc list: ol; title: Table of Contents; minlevel: 2; maxlevel: 3; attachments: yes;]. All arguments are optional.
fr: Chaque apparition de [toc ...] dans le texte sera remplacée par une table des matières déroulable de style MediaWiki. Accepte des options pour le titre, le type de liste, le niveau de titre minimum et maximum, et les fichiers attachés, et ce comme suit: [toc list: ol; title: Table of Contents; minlevel: 2; maxlevel: 3; attachments: yes;]. Tous les arguments sont optionnels.

source: Every instance of "[toc ...]" in the input text will be replaced with a collapsible mediawiki-style table of contents.
fr: Chaque apparition de [toc ...] dans le texte sera remplacée par une table des matières déroulable de style MediaWiki.

source: Use [toc list: ol; title: Table of Contents; minlevel: 2; maxlevel: 3; attachments: yes;] to insert a mediawiki style collapsible table of contents. All the arguments are optional.
fr: Insérer [toc list: ol; title: Table of Contents; minlevel: 2; maxlevel: 3; attachments: yes;] pour afficher une table des matières déroulable de style MediaWiki. Tous les arguments sont optionnels.

source: Use [toc ...] to insert a mediawiki style collapsible table of contents.
fr: Insérer [toc ...] pour afficher une table des matières déroulable de style MediaWiki.

source: Table of contents
fr: Table des matières

source: Inserts a table of contents in place of [toc ...] tags.
fr: Insère une table des matières à la place des balises [toc ...].

source: tableofcontents
fr: tabledesmatieres

source: Adds a filter that generates Tables of contents for pages with '[toc ...]' tags or that have a predetermined number of headers.
fr: Ajoute un filtre qui génère une table des matières pour les pages comportant une balise [toc ...] ou ayant un nombre prédéterminé de titres.

source: Input filters
fr: Filtres d'entrée

source: A module to create named anchors based on HTML headings.
pl: Moduł tworzy zakotwiczenia bazując na nagłówkach HTML.

source: Every instance heading tags will be modified to include an id attribute for anchor linking.
pl: Każdy nagłówek zostanie zmodyfikowany by zawierał atrybut id z możliwością zakotwiczenia.

source: Insert heading anchors automatically.
pl: Wstaw zakotwiczenie nagłówku automatycznie.

source: Headings to Anchors
pl: Nagłówki na zakotwiczenia

source: Inserts named anchors for heading tags automatically.
pl: Wstawia nazwy zakotwiczeń do nagłówków automatycznie.

source: Every instance of "&lt;!--tableofcontents--&gt;" in the input text will be replaced with a collapsible mediawiki-style table of contents. Accepts options for title, list style, minimum heading level, and maximum heading level as follows: &lt;!--tableofcontents list: ol; title: Table of Contents; minlevel: 1; maxlevel: 3;--&gt;. All arguments are optional and defaults are shown.
pl: Każdy znacznik "&lt;!--tableofcontents--&gt;" zostanie zastąpiony rozwijanym spisem treści w stylu mediawiki. Akceptowalnymi parametrami jest zmiana tytułu, styl listy, minimalny i maksymalny poziom nagłówka jako kolejno: &lt;!--tableofcontents list: ol; title: Spis treści; minlevel: 1; maxlevel: 3;--&gt;. Wszytskie agumenty są opcjonalne i domyślnie są widoczne.

source: Insert &lt;!--tableofcontents [list: ol; title: Table of Contents; minlevel: 1; maxlevel: 3;]--&gt; to insert a mediawiki style collapsible table of contents. Arguments within [] are optional (defaults are shown).
pl: Wstaw &lt;!--tableofcontents [list: ol; title: Table of Contents; minlevel: 1; maxlevel: 3;]--&gt; aby wstawić zwijane pole spisu treści. Argumenty w nawiasie [] są opcjonalne (domyślnie są widoczne).

source: Inserts a table of contents in the place of &lt;!--tableofcontents--&gt; tags.
pl: Dołącza spis treści w miejsjcu umieszczenia tagu &lt;!--tableofcontents--&gt;

source: !attachments is an invalid attachments option. Attachments option must be set to yes or no.
pl: !attachments jest nie poprawną opcją załączników. Opcje załączników moga byc ustawione tylko jako 'tak' lub 'nie'.

source: Headings anchors
pl: Zakotwiczenie nagłówków

source: Filter that marks H2 and H3 headings with id anchors from which Tables of Contents can be generated.
pl: Filtr dodający do nagłówków H2 i H3 automatycznie pole id za pomocą ktorego generowany jest spis treści.

source: Filters
pl: Filtry

source: Adds a filter that generates Tables of Contents for pages marked with '&lt;!--tableofcontents--&gt;'.
pl: Dodaje filtr generujący Spis Treści dla strony zawierającej '&lt;!--tableofcontents--&gt;'.
