Repository: psoetens/orocos-www
Catalog: drupal/sites/all/modules/taxonomy_breadcrumb/po/*.po
Languages: it

source: Taxonomy Breadcrumb
it: Tassonomia per il Breadcrumb

source: Configure how taxonomy based breadcrumbs are displayed.
it: Configura come visualizzare il Breadcrumb basandosi sulla tassonomia

source: Basic Settings
it: Configurazione di base

source: Home breadcrumb text
it: Testo per la radice del percorso

source: Text to display at top of breadcrumb trail. Typically home or your site name. Leave blank to have no home breadcrumb.
it: Testo da visualizzare alla radice del percorso di navigazione (breadcrumb). Normalmente viene usato il termine Home. Lasciando il campo vuoto non viene visualizzato nulla come radice.

source: Show current term in breadcrumb trail?
it: Mostrare il corrente termine nel percorso?

source: When enabled, the lightest term associated with node is shown as the last breadcrumb in the breadcrumb trail. When disabled, the only terms shown in the breadcrumb trail are parent terms (if any parents exist). The recommended setting is enabled.
it: Se abilitato, il termine associato a questo nodo è mostrato come ultimo elemento nel percorso di navigazione. Se disabilitato, nel percorso verranno visualizzati solo gli elementi superiori, ammesso che esistano. L'impostazione consigliata è di abilitare il termine corrente.

source: Advanced Settings
it: Configurazioni avanzate

source: Include or exclude the following node types
it: Includi o escludi i seguenti tipi di nodi

source: Include
it: Includi

source: Exclude
it: Escludi

source: Node types to include or exclude
it: Tipi di nodi da includere o escludere

source: Enter a list of node types to include or exclude applying taxonomy based breadcrumbs to. Separate multiple values with spaces. <p>Node types currently enabled:
it: Inserisci una lista di tipi di nodi da includere o escludere nell'applicazione del breadcrumb basato sulla tassonomia. Separare eventuali valori multipli mediante uno spazio. <p>Tipi di nodo attualmente abilitati:

source: <p>See %link.</p>
it: <p>Vedi %link.</p>

source: <p>The taxonomy_breadcrumb module generates taxonomy based breadcrumbs on node pages, where the breadcrumbs link to the normal taxonomy/term pages or to administrator defined pages. Breadcrumbs take the following form:</p> <p>[HOME] >> [VOCABULARY] >> TERM >> [TERM] ...</p> <p><ul> <li>The text displayed for HOME is configurable below. The HOME breadcrumb (if present) will link to the homepage. If the HOME breadcrumb text is not defined (blank), it will not appear in the breadcrumb trail.</li> <li>The VOCABULARY breadcrumb (if present) will link to an administrator defined page (node). If the VOCABULARY does not have an administrator defined page, it will not appear in the breadcrumb trail. This can be configured on the add/edit vocabulary pages within !tax_link (taxonomy).</li> <li>Each TERM breadcrumb will link to either (1) taxonomy/term/tid by default, or (2) an administrator defined page (node) if one is defined for the term. This can be configured on the add/edit term pages within !tax_link (taxonomy).</li> </ul></p> Examples: <ul> <li>home >> term >> term</li> <li>mysite >> term >> term</li> <li>home >> vocabulary >> term >> term</li> <li>vocabulary >> term >> term</li> </ul>
it: <p>Il modulo taxonomy_breadcrumb genera per i vari nodi un breadcrumb (percorso di navigazione) basato sulla Tassonomia, il percorso verrà collegato ai termini della tassonomia o ad altre pagine definite dall'amministratore. Tale percorso di navigazione può assumenre le seguenti forme:</p> <p>[HOME] >> [VOCABOLARIO] >> TERMINE >> [TERMINE] ...</p> <p><ul> <li>Il testo visualizzato in HOME è configurabile qui di seguito. Il termine HOME del breadcrumb, se presente, verrà collegato alla home page, altrimenti (campo vuoto) non verrà mostrato nel percorso di navigazionel.</li> <li>Il VOCABOLARIO breadcrumb (se presente) verrà collegato ad una pagina di amministrazione difinita (node). Se il VOCABOLARIO non ha una pagina di amministrazione definita, non verrà mostrato nel percorso breadcrumb. Questo può essere configurato nella pagina aggiungi/modifica vocabolario con !tax_link (taxonomy).</li> <li>Ogni TERMINE del percorso sarà collegato ad ognuno dei seguenti: (1) tassonomia/termine/tid (default), oppure (2) una pagina definita dall'amministratore (node) se viene definita da qualche termine. Questo può essere configurato nella pagina aggiungi/modifica termine con !tax_link (taxonomy).</li> </ul></p> Esempi: <ul> <li>home >> termine >> termine</li> <li>mysite >> termine >> termine</li> <li>home >> vocabolario >> termine >> termine</li> <li>vocabolario >> termine >> termine</li> </ul>

source: Breadcrumb path (taxonomy_breadcrumb)
it: Percorso (taxonomy_breadcrumb)

source: Specify the path this vocabulary links to as a breadcrumb. If blank, the breadcrumb will not appear. Use a relative path and don't add a trailing slash. For example: node/42 or my/path/alias.
it: Specifica il percorso a cui questo vocabolario viene collegato nel breadcrumb. Se si lascia il campo vuoto, il Breadcrumb non verrà mostrato. Usare un percorso relativo senza aggiungere slash. Per es.: node/42 o mio_percorso/alias

source: Specify the path this term links to as a breadcrumb. If blank, the breadcrumb links to the default taxonomy page. Use a relative path and don't add a trailing slash. For example: node/42 or my/path/alias.
it: Specifica il percorso a cui questo termine viene collegato nel breadcrumb. Se si lascia il campo vuoto, il Breadcrumb verrà riferito alla pagine default della tassonomia. Usare un percorso relativo senza aggiungere slash. Per es. node/42 oppure mio_percorso/alias
