Repository: psoetens/orocos-www
Catalog: drupal/sites/all/modules/user_status/po/*.po
Languages: de, nl

source: None of these notifcations will be sent unless you specify a valid site !email_address on the !site_information settings page.
de: Keine dieser Benachrichtigungen wird gesendet, solange keine gültige !email_address unter !site_information angegeben ist.

source: E-mail address
de: E-Mail-Adresse

source: Site information
de: Website-Informationen

source: This page allows you to configure if automatic emails should be set to users when their account is activated, blocked, or deleted. For each account status, you can control if a notification should be sent, and if so, you define what the subject and body of the resulting email will be.
de: Diese Seite ermöglicht die Konfiguration von automatischen E-Mail-Benachrichtigungen, wenn ein Benutzerkonto aktiviert, gesperrt oder gelöscht wird. Für jeden Status kann eingestellt werden, ob eine Benachrichtigung gesendet werden soll und mit welchem Betreff und Inhalt.

source: For any of the settings below, you can use placeholders which will be substituted with the current values for the user and site.
de: Für alle unten stehenden Einstellungen können Platzhalter verwendet werden, die mit den jeweiligen Werten für Benutzername und dem Namen der Website ersetzt werden.

source: Available variables are:
de: Mögliche Variablen sind:

source: If your site requires administrator approval for new users and you enable the automatic emails below whenever an account is activated, it is highly recommended that you change the text of the welcome message when users first register. By default, they will be sent a temporary password and one-time login URL that will not work, since their account will initially be blocked. It is better to put the initial login information into the notification email when their account is finally approved, so that users are never sent a temporary password and one-time login URL that will not work. You can modify this text at the !user_settings page.
de: Wenn für neue Benutzer die Freischaltung durch einen Administrator erforderlich ist und die automatische Benachrichtigung dafür hier aktiviert ist, ist es empfehlenswert den Text der Begrüßungsmail für neue Registrierungen zu ändern. Standardmäßig wird ein temporäres Passwort und ein einmaliger Anmeldelink gesendet, die nicht funktionieren, da das Benutzerkonto erst einmal gesperrt ist. Besser ist es, diese Anmeldeinformationen mit der Aktivierungsbenachrichtigung zu senden. Der Inhalt kann unter !user_settings geändert werden.

source: User settings
de: Benutzereinstellungen

source: User status notifications
de: Benutzerstatus- benachrichtigungen

source: Configure email notifications when users are set to active, blocked, or deleted.
de: Konfiguration der E-Mail-Benachrichtigungen wenn Benutzerkonten aktiviert, gesperrt oder gelöscht werden.

source: Account details for %username at %site (approved)
de: Informationen zum Benutzerkonto für %username auf %site (freigeschaltet)

source: %username, Your account at %site has been activated. You may now log in by clicking on this link or copying and pasting it in your browser: %login_url This is a one-time login, so it can be used only once. After logging in, you will be redirected to %edit_uri so you can change your password. Once you have set your own password, you will be able to log in to %login_uri in the future using the following username: username: %username
de: %username, Ihr Benutzerkonto auf %site wurde aktiviert. Sie können sich nun durch einen Klick auf den Link oder durch Kopieren und Einfügen des Links in Ihren Browser anmelden: %login_url Dies ist ein einmaliger Anmeldelink, der nur ein einziges Mal verwendet werden kann. Nach dem Anmelden werden Sie zu %edit_uri weitergeleitet, wo Sie Ihr Passwort ändern können. Sobald Sie Ihr Passwort festgelegt haben, können Sie sich zukünftig unter %login_uri mit dem folgenden Benutzernamen anmelden. Benutzername: %username

source: Account %username blocked on %site
de: Benutzerkonto %username auf %site gesperrt

source: %username, Your account on %site has been blocked.
de: %username, Ihr Benutzerkonto auf %site wurde gesperrt.

source: Account %username deleted on %site
de: Benutzerkonto %username auf %site gelöscht

source: %username, Your account on %site has been deleted.
de: %username, Ihr Benutzerkonto auf %site wurde gelöscht.

source: Activated
de: Aktiviert

source: Notify user when account is activated
de: Benutzer benachrichtigen, wenn Konto aktiviert wurde

source: Reset password when account is activated
de: Neues Passwort erstellen, wenn Konto aktiviert wurde

source: Creates a new random password when an account is approved or unblocked. If enabled, this allows a %password placeholder to be used in the notification message.
de: Generiert ein neues zufälliges Passwort, wenn ein Benutzerkonto freigegeben oder entsperrt wird. Es steht dann die Variable %password im Benachrichtigungstext zur Verfügung.

source: Subject
de: Betreff
nl: Onderwerp

source: Body
de: Textkörper
nl: Berichttekst

source: In addition to the variables described above, %login_url (a one-time login URL) is available in the notification message. If the "%reset_password" box is checked, you may also use %password.
de: Zusätzlich zu den oben beschriebenen Variablen steht %login_url (ein einmaliger Anmeldelink) im Benachrichtigungstext zur Verfügung. Ist das Häkchen für "%reset_password" gesetzt, kann auch %password verwendet werden.

source: Blocked
de: Gesperrt

source: Notify user when account is blocked
de: Benutzer benachrichtigen, wenn Konto gesperrt wurde

source: Deleted
de: Gelöscht

source: Notify user when account is deleted
de: Benutzer benachrichtigen, wenn Konto gelöscht wurde

source: user_status
de: Benutzerstatusbenachrichtigungen
nl: gebruiker status

source: Extended user status notifications
de: Erweiterte Benutzerstatusbenachrichtigungen

source: Provides configurable email notifications when users are set to active, blocked, or deleted.
de: Bietet konfigurierbare E-Mail-Benachrichtigungen wenn Benutzerkonten aktiviert, gesperrt oder gelöscht werden.

source: Send user account status change notifications by email.
nl: Verstuur wijzigingen in gebruiker account status, per e-mail.

source: Activate status
nl: Activatie status

source: Notify user when account is activated.
nl: Bericht gebruiker wanneer het account geactiveerd wordt.

source: Use %user as a placeholder for automatic username replacement.
nl: Gebruik %user als een jokerteken voor automatische gebruikersnaam plaatsing.

source: Use %user as a placeholder for automatic username replacement, %site for the name configured in Drupal General Settings, and %loginurl for the login page of this site.
nl: Gebruik %user als een jokerteken voor automatische gebruikersnaam plaatsing, %site voor de sitenaam, en %loginurl voor de aanmeldpagina van deze site.

source: Block status
nl: Blok status

source: Notify user when account is blocked.
nl: Bericht gebruiker wanneer het account geblokkeerd wordt.

source: Use %user as a placeholder for automatic username replacement, and %site for the name configured in Drupal General Settings
nl: Gebruik %user als een jokerteken voor automatische gebruikersnaam plaatsing, %site voor de sitenaam.

source: Delete status
nl: Status verwijderen

source: Notify user when account is deleted.
nl: Bericht gebruiker wanneer het account verwijderd wordt.
