Repository: psoetens/orocos-www
Catalog: drupal/sites/all/modules/captcha/po/*.po
Languages: cs, el

source: The image CAPTCHA is a popular challenge where a random textual code is obfuscated in an image. The image is generated on the fly for each request, which is rather CPU intensive for the server. Be careful with the size and computation related settings.
cs: Image CAPTCHA je populární výzva, ve které je generován textový kód v obrázku. Obrázek je generován 'za letu' pro každý požadavek, což je závislé na CPU serveru. Buďte opatrní při nastavování velikosti a dalších vlastností.
el: Η εικόνα CAPTCHA είναι ένα δημοφιλές είδος πρόκλησης κατά το οποίο ένας τυχαίος κωδικός κειμένου καθίσταται ασαφής μέσα σε μια εικόνα. Η εικόνα δημιουργείται στη στιγμή (on the fly) για κάθε αίτημα, γεγονός που καθιστά απαιτητική τη διαδικασία από πλευρά επεξεργαστικής ισχύος στο διακομιστή. Να είστε προσεκτικοί με το μέγεθος και τις σχετιζόμενες με υπολογισμό ρυθμίσεις.

source: <p>Example image, generated with the current settings:</p>!img
cs: <p>Příklad obrázku, generovaného se současným nastavením:</p>!img
el: <p>Εικόνα παράδειγμα, που έχει δημιουργηθεί με τις τρέχουσες ρυθμίσεις:</p>!img

source: Could not find or read the configured font "%font" for the image captcha.
cs: Nastavené písmo "%font" pro Image CAPTCHu nebylo nalezeno, nebo nelze přečíst.
el: Δεν ήταν δυνατή η εύρεση ή ανάγνωση της γραμματοσειράς "%font" που έχει καθοριστεί για την εικόνα captcha.

source: Encountered an illegal byte while splitting an utf8 string in characters.
cs: Vysketl se ilegalní bit při rozdělování utf8 znaku.
el: Εντοπίστηκε ένας άκυρος χαρακτήρας κατά τη διάρκεια διαχωρισμού μιας φράσης utf8 στους χαρακτήρες.

source: What code is in the image?
cs: Jaký kód je na obrázku?
el: Ποιος είναι ο κωδικός που εμφανίζεται στην εικόνα;

source: Copy the characters (respecting upper/lower case) from the image.
cs: Opište znaky z obrázku (se zachováním malých/velých písmen).
el: Αντιγράψτε τους χαρακτήρες (διατηρώντας τα κεφαλαία/πεζά) από την εικόνα.

source: Image CAPTCHA
el: Εικόνα CAPTCHA

source: Provides an image based CAPTCHA.
el: Παρέχει ένα βασισμένο σε εικόνα CAPTCHA.

source: In this challenge the visitor is asked for the n<sup>th</sup> word of a given phrase.
cs: V této výzvě je návštěvník dotazován na n-té slovo dané fráze.
el: Σε αυτό το είδος πρόκλησης ο επισκέπτης ζητείται να εισάγει την ν<sup>οστή</sup> λέξη μιας δοθείσας φράσης.

source: Text CAPTCHA
el: Κείμενο CAPTCHA

source: Kind of words to use in the phrase
cs: Druh slov pro použití ve frázi
el: Είδος λέξεων που θα χρησιμοποιούνται στη φράση

source: Generate nonsense random words.
cs: Generovat náhodná nesmyslná slova.
el: Δημιουργία τυχαίων λέξεων χωρίς νόημα.

source: Use user defined words.
cs: Použít uživatelsky definová slova.
el: Χρησιμοποίηση καθορισμένων από το χρήστη λέξεων.

source: User defined words
cs: Uživatelsky definová slova
el: Καθορισμένες από το χρήστη λέξεις

source: Enter a bunch of space separated words (at least @min).
cs: Vložte několik slov oddělené mezerami (alespoň @min).
el: Εισάγετε μια σειρά από λέξεις χωρισμένες με το κενό (τουλάχιστον @min).

source: Number of words in the phrase
cs: Počet slov ve frázi
el: Αριθμός λέξεων στη φράση

source: You need to enter at least @min words if you want to use user defined words.
cs: Potřebujete vložit alespoň @min slov, pokud chcete použít uživatelsky definovaná slova.
el: Πρέπει να εισάγετε τουλάχιστον @min λέξεις αν θέλετε να χρησιμοποιείτε καθορισμένες από το χρήστη λέξεις.

source: Number of words in the phrase should be between 4 and 10.
cs: Počet slov ve frázi může být mezi 4 a 10.
el: Ο αριθμός των λέξεων στη φράση πρέπει να είναι μεταξύ 4 και 10.

source: first
cs: první
el: πρώτη

source: second
cs: druhé
el: δεύτερη

source: third
cs: třetí
el: τρίτη

source: fourth
cs: čtvrté
el: τέταρτη

source: fifth
cs: páté
el: πέμπτη

source: sixth
cs: šesté
el: έκτη

source: seventh
cs: sedmé
el: έβδομη

source: eighth
cs: osmé
el: όγδοη

source: ninth
cs: deváté
el: ένατη

source: tenth
cs: desátí
el: δέκατη

source: What is the @nth word in the phrase "@words"?
cs: Jaké je @nth slovo ve frázi "@words"?
el: Ποια είναι η @nth λέξη στη φράση "@words";

source: Provides a simple text based CAPTCHA.
el: Παρέχει ένα βασισμένο σε απλό κείμενο CAPTCHA.

source: No FreeType support
cs: FreeType není podporován

source: FreeType support is required for working with TrueType fonts (.ttf), but the GD library for PHP does not support it.
cs: Podpora FreeType je vyžadována pro práci s písmy (.ttf), ale GD knihovna ji nemá.

source: No GD library
cs: GD knihovna není k dispozici

source: The GD library for PHP is missing or outdated. Please check the <a href="@url">PHP image documentation</a> for information on how to correct this.
cs: GD knihovna v PHP chybí, nebo je zastaralá. Prosím zkontrolujte <a href="@url">Dokumentace k PHP obrázkům</a> pro informace, jak to opravit.
