Repository: psoetens/orocos-www
Catalog: drupal/sites/all/modules/captcha/po/*.po
Languages: cs, el

source: "CAPTCHA" is an acronym for "Completely Automated Public Turing test to tell Computers and Humans Apart". It is typically a challenge-response test to determine whether the user is human. The CAPTCHA module is a tool to fight automated submission by malicious users (spamming) of for example comments forms, user registration forms, guestbook forms, etc. You can extend the desired forms with an additional challenge, which should be easy for a human to solve correctly, but hard enough to keep automated scripts and spam bots out.
cs: "CAPTCHA" je akronym pro "Completely Automated Public Turing test to tell Computers and Humans Apart". Je to typický test toho, zda je uživatel člověk a ne spam robot. Modul CAPTCHA je nástroj pro boj proti odesílání nevyžádaného obsahu na stránky. Požadované formuláře můžete rozšířit o další výzvy, které nebudou pro normální uživatele obtížené vyplnit, ale velice těžké pro spamovací roboty.
el: Το "CAPTCHA" είναι το ακρωνύμιο της φράσης "Completely Automated Public Turing test to tell Computers and Humans Apart". Τυπικά αποτελεί ένα τεστ πρόκλησης-απάντησης για να καθοριστεί αν ο χρήστης είναι άνθρωπος. Η μονάδα CAPTCHA είναι ένα εργαλείο για την καταπολέμηση των αυτοματοποιημένων αποστολών μηνυμάτων από κακόβουλους χρήστες μέσα από, για παράδειγμα, φόρμες, φόρμες δημιουργίας λογαριασμών χρηστών, φόρμες επισκεπτών, κτλ. Μπορείτε να επεκτείνετε τις επιθυμητές φόρμες με μια επιπρόσθετη πρόκληση, που θα είναι εύκολη να λυθεί σωστά από ένα άνθρωπο, αλλά δύσκολη τόσο ώστε να κρατηθούν μακριά αυτοματοποιημένα σενάρια και bot υποβολής ανεπιθύμητων μηνυμάτων.

source: Note that the CAPTCHA module interacts with page caching (see <a href="!performancesettings">performance settings</a>). Because the challenge should be unique for each generated form, the caching of the page it appears on is prevented. Make sure that these forms do not appear on too many pages or you will lose much caching efficiency. For example, if you put a CAPTCHA on the user login block, which typically appears on each page for anonymous visitors, caching will practically be disabled. The comment submission forms are another example. In this case you should set the "%commentlocation" to "%separatepage" in <a href="!commentsettings">the comment settings</a> for better caching efficiency.
cs: Dejte pozor na to, že CAPTCHA spolupracuje s cachováním stránek (více na <a href="!performancesettings">Nastavení výkonu</a>). Protože výzva může být pro každý formulář unikátní, cachování stránek může být vypnuto. Ujistěte se, že tyto formuláře se nevyskytují na více stránkách, nebo cachování může být dosti omezeno. Např. jestliže umístítě CAPTCHu do přihlašovacího bloku, který se typicky zobrazuje na všech stránkách, cachování bude prakticky vypnuté. Formulář komentářů může být další příklad. V tomto případě se doporučuje nastavit jeho umístění na vlastní samostatnou stránku.
el: Πρέπει να σημειωθεί ότι η μονάδα CAPTCHA αλληλεπιδρά με το μηχανισμό λανθάνουσας σελίδας (δείτε τις <a href="!performancesettings">ρυθμίσεις για την απόδοση</a>). Για το λόγο ότι η πρόκληση πρέπει να είναι μοναδική για κάθε φόρμα που δημιουργείται, η αποθήκευση της σελίδας στη λανθάνουσα μνήμη πρέπει να αποφεύγεται. Να είστε σίγουροι ότι οι φόρμες αυτές δεν εμφανίζονται σε πάρα πολλές σελίδες, διαφορετικά θα χάνατε την αποδοτικότητα της λανθάνουσας μνήμης. Για παράδειγμα, αν τοποθετήσετε ένα CAPTCHA στο μπλοκ εισόδου χρήστη, που τυπικά εμφανίζεται σε κάθε σελίδα για τους ανώνυμους επισκέπτες, πρακτικά η λανθάνουσα μνήμη θα απενεργοποιηθεί. Οι φόρμες υποβολής σχολίων είναι ένα ακόμη παράδειγμα. Στην περίπτωση αυτή, θα πρέπει να ορίσετε την "%commentlocation" σε "%separatepage" στη <a href="!commentsettings">σελίδα ρυθμίσεων των σχολίων</a> για καλύτερα αποτελεσματικότητα της λανθάνουσας μνήμης.

source: Location of comment submission form
cs: Pozice odesílacího formuláře pro komentáře
el: Που θα εμφανίζεται η φόρμα υποβολής σχολίων

source: Display on separate page
cs: Zobrazit na samostatné stránce
el: Εμφάνιση σε ξεχωριστή σελίδα

source: CAPTCHA is a trademark of Carnegie Mellon University.
cs: CAPTCHA je registrovaná ochranná známka Carnegie Mellon University.
el: Το CAPTCHA είναι σήμα κατατεθέν του Πανεπιστημίου Carnegie Mellon.

source: <p>A CAPTCHA can be added to virtually each Drupal form. Some default forms are already provided in the form list, but arbitrary forms can be easily added and managed when the option "%adminlinks" is enabled.</p><p>Users with the "%skipcaptcha" <a href="@perm">permission</a> won't be offered a challenge. Be sure to grant this permission to the trusted users (e.g. site administrators). If you want to test a protected form, be sure to do it as a user without the "%skipcaptcha" permission (e.g. as anonymous user).</p>
cs: <p>CAPTCHA může být přidána k jakémukoliv formuláři v Drupalu. Některé hodně používané formuláře jsou již nabídnuty v seznamu formulářů, ale jakékoliv další mohou být lehce přidány pomocí "%adminlinks".</p><p>Uživatelé s oprávněním "%skipcaptcha" <a href="@perm">permission</a> nebudou muset výzvy vypňovat. Dejte si pozor, komu oprávnění přidělujete (např. správci webu). Pokud chcete CAPTCHu otestovat, ujistěte se, že to provádít bez oprávnění "%skipcaptcha" (např. jako anonymní uživatel).</p>
el: <p>Ένα CAPTCHA μπορεί να τοποθετηθεί ουσιαστικά σε οποιαδήποτε φόρμα του Drupal. Ορισμένες εξ' ορισμού φόρμες παρέχονται στη λίστα παρακάτω, αλλά αυθαίρετες φόρμες μπορούν εύκολα να προστεθούν και να διαχειριστούν όταν η επιλογή "%adminlinks" είναι ενεργοποιημένη.</p><p>Στους χρήστες με την <a href="@perm">άδεια</a> "%skipcaptcha" δε θα εμφανίζονται προκλήσεις. Να παραχωρήσετε την άδεια αυτή σε έμπιστους χρήστες (πχ. διαχειριστές ιστοτόπου). Αν θέλετε να δοκιμάσετε μια προστατευμένη φόρμα, κάντε το ως χρήστης χωρίς την άδεια "%skipcaptcha" (πχ. ως ανώνυμος χρήστης).</p>

source: Add CAPTCHA administration links to forms
cs: Přidat CAPTCHA administrátorské odkazy k formulářům
el: Προσθήκη των παραπομπών διαχείρισης του CAPTCHA στις φόρμες

source: Administer how and where CAPTCHAs are used.
cs: Nastavení jak a kde je CAPTCHA používána.
el: Διαχείριση του πως και που θα χρησιμοποιούνται τα CAPTCHA.

source: General settings
cs: Hlavní nastavení
el: Γενικές ρυθμίσεις

source: Examples
cs: Příklady
el: Παραδείγματα

source: An overview of the available challenge types with examples.
cs: Přehled dostupných typů výzev s příklady.
el: Μια σύνοψη όλων των διαθέσιμων τύπων προκλήσεων μαζί με παραδείγματα.

source: This question is for testing whether you are a human visitor and to prevent automated spam submissions.
cs: Tato otázka je pro testování zda jste opravdoví hosté a předejít tak automatizovaným spamovým robotům.
el: Η ερώτηση αυτή χρησιμοποιείται για να καθοριστεί αν είστε άνθρωπος και για την αποτροπή αυτοματοποιημένων υποβολών ανεπιθύμητων μηνυμάτων.

source: Disabled CAPTCHA for form %form_id.
cs: CAPTCHA pro formulář %form_id byla vypnuta.
el: Το CAPTCHA για τη φόρμα %form_id απενεργοποιήθηκε.

source: Deleted CAPTCHA for form %form_id.
cs: CAPTCHA pro formulář %form_id byla vymazána.
el: Το CAPTCHA για τη φόρμα %form_id διαγράφηκε.

source: This option is very helpful to enable/disable challenges on forms. When enabled, users with the "%admincaptcha" permission will see CAPTCHA administration links on all forms (except on administrative pages, which shouldn't be accessible to untrusted users in the first place). These links make it possible to enable a challenge of the desired type or disable it.
cs: Tato volba je velice užitečná pro zapínání/vypínání výzev pro formuláře. Pokud je zapnuta, uživatelé s oprávněním "%admincaptcha" uvidí administrační odkazy CAPTCHy u všech formulářů (kromě těch v administraci). Tyto odkazy umožňují zapnout výzvy pro různé typy formulářů.
el: Η επιλογή αυτή είναι χρήσιμη για την ενεργοποίηση/απενεργοποίηση των προκλήσεων CAPTCHA στις φόρμες. Όταν είναι ενεργοποιημένη, χρήστες με την άδεια "%admincaptcha" θα βλέπουν τις παραπομπές διαχείρισης του CAPTCHA σε όλες τις φόρμες (εκτός από τις σελίδες διαχείρισης, που δεν είναι εξαρχής προσβάσιμες σε μη έμπιστους χρήστες). Οι παραπομπές αυτές επιτρέπουν την ενεργοποίηση μιας πρόκλησης ενός ορισμένου τύπου ή την απενεργοποίησή της.

source: Challenge type per form
cs: Pro každý formulář vybrat typ výzvy
el: Τύπος πρόκλησης ανά φόρμα

source: Select the challenge type you want for each of the listed forms (identified by their so called <em>form_id</em>'s). You can easily add arbitrary forms with the help of the '%CAPTCHA_admin_links' option.
cs: Vyberte typ výzvy, kterou chcete použít pro zde vypsané formuláře (identifikovatelné dle <em>form_id</em>). Můžete sem lehce přidat další formuláře pomocí volby '%CAPTCHA_admin_links'.
el: Επιλέξτε τον τύπο της πρόκλησης που θέλετε για καθεμία από τις παρακάτω φόρμες (που είναι αναγνωρίσιμες από τα λεγόμενα <em>form_id</em>). Μπορείτε εύκολα να προσθέσετε οποιεσδήποτε φόρμες με τη βοήθεια της επιλογής '%CAPTCHA_admin_links'.

source: delete
cs: smazat
el: διαγραφή

source: Challenge description
cs: Popis výzvy
el: Περιγραφή πρόκλησης

source: With this description you can explain the purpose of the challenge to the user.
cs: Pomocí tohoto popisku můžete vysvětlit uživatelům důvod výzvy.
el: Με την περιγραφή αυτή εξηγείτε στο χρήστη το σκοπό επίλυσης της πρόκλησης.

source: For language %lang_name (code %lang_code)
cs: Pro jazyk %lang_name (code %lang_code)
el: Για τη γλώσσα %lang_name (κωδικός %lang_code)

source: Persistence
cs: Stálost
el: Διατήρηση

source: Always add a challenge.
cs: Vždy přidat výzvu.
el: Πάντα προσθήκη μιας πρόκλησης.

source: Omit challenges for a form once the user has successfully responded to a challenge for that form.
cs: Vynechat výzvy u tohoto formuláře, pokud uživatel správně odpoví na jeho první výzvu.
el: Παράλειψη προκλήσεων για μια φόρμα αφού ο χρήστης έχει απαντήσει με επιτυχία σε μια πρόκληση της φόρμας αυτής.

source: Omit challenges for all forms once the user has successfully responded to a challenge.
cs: Vynechat výzvy u všech formulářů, pokud uživatel správně odpoví na první výzvu.
el: Παράλειψη προκλήσεων για όλες τις φόρμες αφού ο χρήστης έχει απαντήσει με επιτυχία σε μια πρόκληση.

source: Define if challenges should be omitted during the rest of a session once the user successfully responses to a challenge.
cs: Definujte, jestli po první správně vyplněné výzvě, mají být další již přeskočeny během jednoho session uživatele.
el: Καθορίστε αν οι προκλήσεις θα παραλείπονται για το υπόλοιπο της διάρκειας μιας συνόδου αφού ο χρήστης έχει απαντήσει με επιτυχία σε μια πρόκληση.

source: Log wrong responses
cs: Logovat špatné odpovědi
el: Καταγραφή λανθασμένων απαντήσεων

source: Report information about wrong responses to the !watchdoglog.
cs: Odesílat informace o špatných vyplněních do !watchdoglog.
el: Αναφορά πληροφοριών σχετικά με λανθασμένες απαντήσεις στο !watchdoglog.

source: Submit
cs: Odeslat
el: Υποβολή

source: Challenge type (module)
cs: Typ výzvy (modul)
el: Τύπος πρόκλησης (μονάδα)

source: Operations
cs: Operace
el: Λειτουργίες

source: The CAPTCHA settings were saved.
cs: Nastavení CAPTCHA bylo uloženo.
el: Οι ρυθμίσεις CAPTCHA αποθηκεύθηκαν.

source: Select the challenge for @form_id
cs: Vyberte výzvu pro @form_id
el: Επιλέξτε την πρόκληση για τη φόρμα με αναγνωριστικό @form_id

source: Cancel
cs: Zrušit
el: Άκυρο

source: Unavailable form_id %form_id
cs: Nedostupný form_id %form_id
el: Μη διαθέσιμο αναγνωριστικό φόρμας %form_id

source: Saved CAPTCHA settings.
cs: CAPTCHA nastavení uloženo.
el: Οι ρυθμίσεις CAPTCHA αποθηκεύτηκαν.

source: CAPTCHA problem: hook_captcha() of module %module returned nothing when trying to retrieve challenge type %type for form %form_id.
cs: CAPTCHA problem: hook_captcha() modulu %module nic nevrátil když se pokoušel vrátit typ výzvy %type pro formulář %form_id.
el: Σφάλμα CAPTCHA: Η συνάρτηση hook_captcha() της μονάδας %module δεν επέστρεψε κάτι κατά τη διάρκεια ανάκτησης του τύπου πρόκλησης %type για τη φόρμα με αναγνωριστικό %form_id.

source: Untrusted users will see a CAPTCHA here (!settings).
cs: Nedůvěryhodní uživatelé zde uvidí CAPTCHu (!settings).
el: Οι μη έμπιστοι χρήστες θα βλέπουν εδώ ένα CAPTCHA (!settings).

source: general CAPTCHA settings
cs: hlavní nastavení CAPTCHA
el: γενικές ρυθμίσεις CAPTCHA

source: Enabled challenge
cs: Povolené výzvy
el: Η πρόκληση ενεργοποιήθηκε

source: "@type" by module "@module" (!change, !disable)
cs: "@type" modulu "@module" (!change, !disable)
el: "@type" από τη μονάδα "@module" (!change, !disable)

source: change
cs: změnit
el: αλλαγή

source: disable
cs: zakázat
el: απενεργοποίηση

source: Place a CAPTCHA here for untrusted users.
cs: Umístit zde CAPTCHu pro nedůvěryhodné uživatele.
el: Τοποθέτηση εδώ μιας πρόκλησης CAPTCHA για τους μη έμπιστους χρήστες.

source: Cookies should be enabled in your browser for CAPTCHA validation.
cs: Pro kontrolu CAPTCHA by měly být zapnuty cookies.
el: Τα cookies θα πρέπει να είναι ενεργοποιημένα στο πρόγραμμα πλοήγησής σας για την επαλήθευση του CAPTCHA.

source: Invalid CAPTCHA token.
cs: Neplatný token CAPTCHA.
el: Μη έγκυρο σύμβολο CAPTCHA.

source: The answer you entered for the CAPTCHA was not correct.
cs: Vyplněná odpověď na CAPTCHA není správná.
el: Η απάντηση που δώσατε για την πρόκληση CAPTCHA δεν είναι σωστή.

source: %form_id post blocked by CAPTCHA module: challenge "%challenge" (by module "%module"), user answered "%response", but the solution was "%solution".
cs: Formulář %form_id byl zablokovám modulem CAPTCHA: výzva "%challenge" (by module "%module"), uživatel odpověděl "%response", ale odpověď byla "%solution".
el: Η υποβολή από τη φόρμα με αναγνωριστικό %form_id εμποδίστηκε από τη μονάδα CAPTCHA: πρόκληση "%challenge" (από τη μονάδα "%module"), ο χρήστης απάντησε "%response", αλλά η λύση ήταν "%solution".

source: You can't request more than @num challenges without solving them. Your previous challenges were flushed.
el: Δεν μπορείτε να ζητήσετε παραπάνω από @num προκλήσεις CAPTCHA προτού τις επιλύσετε. Οι προηγούμενες προκλήσεις έχουν διαγραφεί.

source: This page gives an overview of all available challenge types, generated with their current settings.
cs: Tato stránka poskytuje přehled všech dostupných výzev generovaných s jejich nastavením.
el: Η σελίδα αυτή δίνει μια σύνοψη όλων των διαθέσιμων τύπων προκλήσεων, μαζί με τις υπάρχουσες ρυθμίσεις τους.

source: Challenge "%challenge" by module "%module"
cs: Výzva "%challenge" dle modulu "%module"
el: Πρόκληση "%challenge" από τη μονάδα "%module"

source: 10 more examples of this challenge.
cs: Dalších 10 příkladů pro tuto výzvu.
el: 10 περισσότερα παραδείγματα αυτής της πρόκλησης.

source: Math Question
cs: Matematická otázka
el: Μαθηματικό πρόβλημα

source: Solve this simple math problem and enter the result. E.g. for 1+3, enter 4.
cs: Vyřešte tento jednoduchý matematický problém a vložte výsledek. Např. pro 1+3, zapište 4.
el: Επιλύστε αυτό το απλό μαθηματικό πρόβλημα και εισάγετε το αποτέλεσμα. Π.χ. για το 1+3, εισάγετε 4.

source: Already @counter blocked form submissions
cs: @counter neoprávněných vyplnění formulářů již bylo zablokováno
el: Απεφεύχθησαν μέχρι τώρα @counter υποβολές μέσω φόρμας

source: administer CAPTCHA settings
cs: spravovat nastavení CAPTCHA
el: διαχείριση των ρυθμίσεων CAPTCHA

source: skip CAPTCHA
cs: přeskočit CAPTCHu
el: παράλειψη του CAPTCHA

source: Unsupported database.
el: Μη υποστηριζόμενη βάση δεδομένων.

source: The installation of the captcha_points table and some default entries was successful
el: Η εγκατάσταση του πίνακα captcha_points και ορισμένων εξ' ορισμού εγγραφών έγινε με επιτυχία

source: The installation of the CAPTCHA module failed
el: Η εγκατάσταση της μονάδας CAPTCHA απέτυχε

source: Base CAPTCHA module for adding challenges to arbitrary forms.
el: Βασική μονάδα CAPTCHA για την προσθήκη προκλήσεων CAPTCHA σε διάφορες φόρμες.

source: Spam control
el: Έλεγχος υποβολής ανεπιθύμητων μηνυμάτων

source: Built-in font
cs: Built-in písma
el: Ενσωματωμένη γραμματοσειρά

source: Images cannot be generated, because your PHP installation's GD library has no JPEG support.
cs: Obrázky nemohly být vygenerovány, protože GD knihovna nepodporuje JPEG.
el: Οι εικόνες CAPTCHA δεν μπορούν να δημιουργηθούν, γιατί η βιβλιοθήκη GD της εγκατάστασης PHP δεν παρέχει υποστήριξη για JPEG.

source: Code settings
cs: Nastavení kódu
el: Ρυθμίσεις κωδικού

source: Characters to use in the code
cs: Znaky k použití v kódu
el: Χαρακτήρες που θα χρησιμοποιούνται στον κωδικό

source: Code length
cs: Délka kódu
el: Μήκος κωδικού

source: The code length influences the size of the image. Note that larger values make the image generation more CPU intensive.
cs: Délka kódu ovlivňuje velikost obrázku. Dejte pozor, že vysoké hodnoty zapříčiní generování obrázku náročnější na CPU.
el: Το μήκος κωδικού επηρεάζει το μέγεθος της εικόνας. Πρέπει να σημειωθεί ότι μεγάλες τιμές θα καταστήσουν τη δημιουργία εικόνων απαιτητική από πλευρά υπολογιστικής ισχύος.

source: Font settings
cs: Nastavení písma
el: Ρυθμίσεις γραμματοσειράς

source: Font
cs: Písmo
el: Γραμματοσειρά

source: The TrueType font (.ttf) to use for the text in the image CAPTCHA.
cs: TrueType písmo (.ttf) pro použití v image CAPTCHA.
el: Η TrueType γραμματοσειρά (.ttf) που θα χρησιμοποιηθεί για το κείμενο της εικόνας CAPTCHA.

source: Font size
cs: Velikost písma
el: Μέγεθος γραμματοσειράς

source: tiny
cs: nejmenší
el: ελάχιστο

source: small
cs: malé
el: μικρό

source: normal
cs: normální
el: κανονικό

source: large
cs: velké
el: μεγάλο

source: The font size influences the size of the image. Note that larger values make the image generation more CPU intensive.
cs: Velikost písma ovlivňuje velikost obrázku. Dete pozor, že velké hodnoty způsobí při generování obrázku větší zátěž CPU.
el: Το μέγεθος της γραμματοσειράς επηρεάζει το μέγεθος της εικόνας. Πρέπει να σημειωθεί ότι μεγάλες τιμές θα καταστήσουν τη δημιουργία εικόνων απαιτητική από πλευρά υπολογιστικής ισχύος.

source: Character spacing
cs: Mezery mezi znaky
el: Απόσταση χαρακτήρων

source: Define the average spacing between characters. Note that larger values make the image generation more CPU intensive.
cs: Definujte průměrné mezery mezi znaky. Pozor na to, že větší hodnoty způsobí při generování obrázku věteší zátěž CPU.
el: Ορισμός της μέσης απόστασης μεταξύ των χαρακτήρων. Πρέπει να σημειωθεί ότι μεγάλες τιμές θα καταστήσουν τη δημιουργία εικόνων απαιτητική από πλευρά υπολογιστικής ισχύος.

source: Distortion and noise
cs: Pokřivení a šum
el: Παραμόρφωση και θόρυβος

source: With these settings you can control the degree of obfuscation by distortion and added noise. Do not exaggerate the obfuscation and assure that the code in the image is reasonably readable. For example, do not combine high levels of distortion and noise.
cs: S tímto nastavením můžete kontrolovat stupeň zatemnění dle zkreslení a přidaného šumu. Nepřehánějte zatemnění a ujistěte se, že je kód v obrázku rozumně čitelný. Např. nekombinutje vysokoé hodnoty zkroucení a šumu.
el: Με αυτές τις ρυθμίσεις μπορείτε να ελέγξετε το βαθμό ασάφειας λόγω παραμόρφωσης και του πρόσθετου θορύβου. Μην υπερβάλλετε με την ασάφεια και σιγουρευτείτε ώστε ο κωδικός στην εικόνα να είναι εύκολα αναγνώσιμος. Για παράδειγμα, μη συνδυάζετε υψηλά επίπεδα παραμόρφωσης και θορύβου.

source: Distortion level
cs: Úrověň zkroucení
el: Επίπεδο παραμόρφωσης

source: none
cs: nic
el: κανένα

source: low
cs: málo
el: χαμηλό

source: moderate
cs: středně
el: μέτριο

source: high
cs: hodně
el: υψηλό

source: severe
cs: krutý
el: δριμύ

source: Set the degree of wave distortion in the image.
cs: Nastavte stupeň vlnového zkreslení obrázku.
el: Ορίστε το βαθμό παραμόρφωσης της εικόνας.

source: Smooth distortion
cs: Hladké pokřivení
el: Απαλή παραμόρφωση

source: This option enables bilinear interpolation of the distortion which makes the image look smoother, but it is more CPU intensive.
cs: Tato možnost
el: Η επιλογή αυτή ενεργοποιεί διγραμμική παρεμβολή παραμόρφωσης που κάνει την εικόνα να δείχνει πιο ομαλή, αλλά είναι απαιτητική αναφορικά με την υπολογιστική ισχύ.

source: Double vision
cs: Dvojité zobrazení
el: Διπλή όψη

source: When enabled, characters appear twice in the image, overlaid onto each other.
cs: Pokud je zapnuto, znaky se na obrázku vyskytují dvakrát různě přes sebe.
el: Όταν είναι ενεργοποιημένη, οι χαρακτήρες εμφανίζονται δύο φορές στην εικόνα, επικαλυπτόμενοι μεταξύ τους.

source: Add salt and pepper noise
cs: Přidat zrnitý a papírový šum
el: Προσθήκη θορύβου "αλατιού" και "πιπεριού"

source: This option adds randomly colored point noise.
cs: Tato volba přidá náhodný, tečkovany, barevný šum.
el: Η επιλογή αυτή προσθέτει τυχαίο θόρυβο σε διάφορους χρωματισμούς.

source: Add line noise
cs: Přidat řádkové rušení
el: Προσθήκη θορύβου γραμμής

source: This option enables lines randomly drawn on top of the text code.
cs: Tato volba přidá linky náhodně vykreslené navrchu textového kódu.
el: Η επιλογή αυτή προσθέτει τυχαίες γραμμές πάνω στο κείμενο του κωδικού.

source: Noise level
cs: Úroveň šumu
el: Επίπεδο θορύβου

source: The image CAPTCHA module works best with a TrueType font file (TTF) for generating the images, but because of licencing issues it is not allowed to package fonts with the module. A simple built-in bitmap font is provided as default instead. You can install TrueType fonts yourself by putting them in the fonts directory of the image CAPTCHA module (directory "%fontsdir") or by uploading them to your Drupal file system (directory "%filesdir") with for example the upload module.
cs: Image CAPTCHA modul funguje nejlépe s TrueType souborem písma (TTF) pro generování obrázků, ale kvůli problémům s licencemi není dovoleno přibalovat písma k modulu. Jednoduché built-in bitmapové písmo je dodávání jako výchozí. Můžete nainstalovat TrueType písma sami, vložením do adresáře s TrueType písmy (adresář "%fontsdir") nebo nahráním do souborového systému Drupalu (adresář "%filesdir") za pomoci např. upload modulu.
el: Η μονάδα εικόνων CAPTCHA δουλεύει καλύτερα με μια γραμματοσειρά τύπου TrueType (TTF) για τη δημιουργία των εικόνων, αλλά λόγω θεμάτων άδειας δεν επιτρέπεται το πακετάρισμα γραμματοσειρών με τη μονάδα. Αντίθετα, παρέχεται ως εξ' ορισμού μια απλή bitmap γραμματοσειρά. Μπορείτε να εγκαταστήσετε γραμματοσειρές TrueType μόνοι σας τοποθετώντας τις στον κατάλογο fonts της μονάδας εικόνων CAPTCHA (κατάλογος "%fontsdir") ή ανεβάζοντάς τις στο σύστημα αρχείων του Drupal (κατάλογος "%filesdir") για παράδειγμα μέσω της μονάδας αποστολής.

source: The usage of the built-in bitmap font it is not recommended because of its small size and missing UTF-8 support.
cs: Použití built-in bitmapového písma není doporočuno, protože má malé rozměry a nemá podporu UTF-8.
el: Δεν προτείνεται η χρησιμοποίηση της ενσωματωμένης bitmap γραμματοσειράς λόγω του μικρού της μεγέθους και της έλλειψης υποστήριξης UTF-8.

source: The list of characters to use should not contain spaces.
cs: Seznam znaků k použití by neměl obsahovat mezery.
el: Η λίστα των χαρακτήρων που θα χρησιμοποιηθούν δεν πρέπει να περιέχει κενά.

source: You need to select a font
cs: Musíte vybrat písmo
el: Πρέπει να επιλέξετε μια γραμματοσειρά

source: Font does not exist or is not readable.
cs: Písmo neexistuje, nebo není čitelné.
el: Η γραμματοσειρά είτε δεν υπάρχει είτε δεν είναι αναγνώσιμη.

source: Generation of image CAPTCHA failed. Check your image CAPTCHA configuration and especially the used font.
cs: Generování obrázku CAPTCHy selhalo. Zkontrolujte nastavení a hlavně používané písmo.
el: Η δημιουργία της εικόνας CAPTCHA απέτυχε. Ελέγξτε τις ρυθμίσεις των εικόνων CAPTCHA και ειδικότερα της γραμματοσειράς που χρησιμοποιείται.
