Repository: psoetens/orocos-www
Catalog: drupal/sites/default/modules/captcha/po/*.po
Languages: es, fr, it, ru

source: Note that the CAPTCHA module interacts with page caching (see <a href="!performancesettings">performance settings</a>). Because the challenge should be unique for each generated form, the caching of the page it appears on is prevented. Make sure that these forms do not appear on too many pages or you will lose much caching efficiency. For example, if you put a CAPTCHA on the user login block, which typically appears on each page for anonymous visitors, caching will practically be disabled. The comment submission forms are another example. In this case you should set the "%commentlocation" to "%separatepage" in <a href="!commentsettings">the comment settings</a> for better caching efficiency.
es: Nótese que el modulo CAPTCHA interactúa con la caché de páginas (ver <a href="!performancesettings">configuraciones de rendimiento</a>). Ya que el reto debería ser único para cada formulario generado, se impide el almacenamiento de la página donde aparece. Asegúrese de que estos formularios no aparecen en demasiadas páginas o se perderá eficiencia en la cache. Por ejemplo, si se pone un CAPTCHA en el bloque de entrada de usuario, que típicamente aparece en cada página para los visitantes anónimos, la caché quedará prácticamente deshabilitada. El formulario de envío de comentarios es otro ejemplo. En este caso, se debería poner "%commentlocation" a "%separatepage" en <a href="!commentsettings">configuración de comentarios</a> para una mejor eficiencia de la cache.
fr: Notez que le module CAPTCHA interagit avec la mise en cache des pages (voir <a href="!performancesettings">paramètres de performance</a>). Afin que la question test (défi) demeure unique pour chaque formulaire, le module empêche la mise en cache des pages sur lesquelles il apparaît. Assurez-vous que ces formulaires ne figurent pas sur un trop grand nombre de pages ou vous perdrez de la performance. Par exemple, si vous mettez un CAPTCHA sur le bloc de connexion des utilisateurs, qui figurent habituellement sur chaque page pour les visiteurs anonymes, la mise en cache sera pratiquement désactivée. Les formulaires de soumission de commentaires constituent un autre exemple. Dans ce cas, vous devez régler le paramètre "%commentlocation" à la valeur "%separatepage" dans les <a href="!commentsettings"> paramètres des commentaires</a> pour assurer une meilleure efficacité de la cache.
it: Nota che il modulo CAPTCHA interagisce con la memorizzazione in cache delle pagine (leggi <a href="!performancesettings">impostazioni sulle prestazioni</a>). Poiché la verifica dovrebbe essere unica per ogni form generato, le pagine dove apparirà non saranno memorizzate in cache. Verifica che questi form non appaiano su troppe pagine o perderai i vantaggi della cache. Per esempio, se poni un CAPTCHA sul blocco di accesso utente, che praticamente appare su ogni pagine per i visitatori anonimi, la cache praticamente verrà disabilitata. L'invio di commenti può essere un altro esempio. In questo caso dovresti impostare "%commentlocation" in "%separatepage" nelle <a href="!commentsettings">impostazioni commenti</a> per una maggiore efficienza della cache.

source: general CAPTCHA settings
it: amministrare le impostazioni di CAPTCHA

source: Place a CAPTCHA here for untrusted users.
it: Mette qui una richiesta CAPTCHA per gli utenti non attendibili.

source: The installation of the captcha_points table and some default entries was successful.
it: Installazione della tabella captcha_points e delle voci predefinite riuscita

source: The installation of the CAPTCHA module failed.
it: L'installazione del modulo 'CAPTCHA' è fallita

source: Could not find or read the configured font "%font" for the image CAPTCHA.
it: Impossibile trovare o leggere il font configurato "%font" per l'immagine captcha.

source: text_captcha
it: text_capcha
