Repository: psoetens/orocos-www
Catalog: drupal/sites/default/modules/captcha/po/*.po
Languages: es, fr, it, ru

source: Code length
es: Longitud del código
fr: Longueur du code
it: Lunghezza codice
ru: Длина кода

source: The code length influences the size of the image. Note that larger values make the image generation more CPU intensive.
es: La longitud del código influencia el tamaño de la imagen. Sea consciente de que a mayor tamaño de la imagen, mayor consumo de CPU.
fr: La longueur du code influence la taille de l'image. Notez que des valeurs plus grandes ralentissent la génération de l'image.
it: La lunghezza del codice influenza la dimensione dell'immagine. Da notare che valori più grandi generano un utilizzo più intensivo della CPU.
ru: Длина кода в графических задачах влияет на величину изображения. Замечание: большее значение использует ресурсы процессора интенсивнее.

source: Font settings
es: Configuración de fuentes
fr: Paramètres des police de caractères
it: Impostazioni del carattere
ru: Настройки шрифта

source: Font
es: Fuente
fr: Police de caractères
ru: Шрифт

source: The TrueType font (.ttf) to use for the text in the image CAPTCHA.
es: Fuente TrueType (.ttf) para usar en el CAPTCHA imagen.
fr: La police TrueType (.ttf) utilisée pour afficher le texte dans l'image CAPTCHA.
it: Il carattere TrueType (.ttf) utilizzato per il testo nell'immagine CAPTCHA.
ru: Шрифт TrueType (.ttf), используемый в графических задачах.

source: Font size
es: Tamaño de la fuente
fr: Taille de la police
it: Dimensione font
ru: Размер шрифта

source: tiny
es: diminuto
fr: minuscule
it: minuscolo
ru: крошечн.

source: small
es: pequeño
fr: petit
it: piccolo
ru: маленьк.

source: normal
it: normale
ru: нормальн.

source: large
es: grande
fr: grand
it: grande
ru: крупн.

source: The font size influences the size of the image. Note that larger values make the image generation more CPU intensive.
es: El tamaño de fuente influencia el tamaño de la imagen. Sea consciente de que a mayores tamaños, mayor consumo de CPU.
fr: La taille de la police influence la taille de l'image. Notez que des valeurs plus grandes ralentissent la génération de l'image.
it: La dimensione del carattere influenza la dimensione dell'immagine. Da notare che valori più grandi generano un utilizzo più intensivo della CPU.
ru: Размер шрифта влияет на размер изображения. Замечание: большее значение использует ресурсы процессора интенсивнее.

source: Character spacing
es: Espaciado de caracteres
fr: Espace entre les caractères
it: Distanza tra i caratteri
ru: Межсимвольное расстояние

source: Define the average spacing between characters. Note that larger values make the image generation more CPU intensive.
es: Define la separación media entre caracteres. Sea consciente de que valores mayores causan mayor consumo de CPU.
fr: Définit l'espace moyen entre les caractères. Notez que des valeurs plus grandes ralentissent la génération de l'image.
it: Definire la spaziatura media tra i caratteri. Si noti che i valori più grandi rendono la generazione dell'immagine più impegnativa per la CPU.
ru: Задает межсимвольное расстояние. Замечание: большее значение использует ресурсы процессора интенсивнее.

source: Distortion and noise
es: Distorsión y ruido
fr: Distorsion et bruit
it: Distorsione e disturbo
ru: Искажение и шум

source: With these settings you can control the degree of obfuscation by distortion and added noise. Do not exaggerate the obfuscation and assure that the code in the image is reasonably readable. For example, do not combine high levels of distortion and noise.
es: Con estas configuraciones se puede controlar el grado de ofuscación distorsionando y añadiendo ruido. No exagere la ofuscación y asegúrese de que el código en la imagen es razonablemente legible. Por ejemplo, no combine niveles altos de distorsión y ruido.
fr: Avec ces paramètres, vous pouvez contrôler le degré d'obscurcissement en ajoutant de la distorsion et du bruit visuel. Ne pas exagérer le degré d'obscurcissement et s'assurer que le code est assez lisible. Par exemple, ne pas combiner des niveaux élevés de distorsion et de bruit.
it: Con queste impostazioni puoi controllare il grado di offuscamento e di distorsione da aggiungere al disturbo. Non esagerare con l'offuscamento e assicurati che il codice nell'immagine sia ragionevolmente leggibile. Per esempio, non combinare elevati livelli di distorsione e rumore.
ru: Этими настройками вы можете контролировать степень искажения. Не преувеличивайте степень исхожения, а после перенастройки убедитесь в том, что код в изображении остается читабельным (например, не комбинируйте высокий уровень искажения и шума).

source: Distortion level
es: Nivel de distorsión
fr: Niveau de distorsion
it: Livello distorsione
ru: Уровень искажения

source: none
es: ninguno
fr: aucun
it: nessuno
ru: нет

source: low
es: baja
fr: bas
it: bassa
ru: низк.

source: moderate
es: moderada
fr: modéré
it: moderato
ru: умеренн.

source: high
es: alta
fr: élevé
it: alto
ru: высок.

source: severe
es: severa
fr: sévère
it: forte
ru: серьезн.

source: Set the degree of wave distortion in the image.
es: Establece el grado de distorsión en ondas de la imagen.
fr: Régler le degré de distorsion ondulatoires dans l'image.
it: Imposta il grado di distorsione delle onde nell'immagine.
ru: Установить степень волнового искажения.

source: Smooth distortion
es: Distorsión suave
fr: Distorsion lisse
it: Distorsione lieve
ru: Сглаживание

source: This option enables bilinear interpolation of the distortion which makes the image look smoother, but it is more CPU intensive.
es: Esta opción activa la interpolación bilinear de la distorsión, lo que hace que la imagen se vea más suave, pero consume más CPU.
fr: Cette option permet une interpolation bilinéaire de la distorsion qui rend l'image plus agréable, mais cette procédure est plus intensive pour le processeur.
it: Questa opzione abilita l'interpolazione bilineare della distorsione che rende più agevole guardare l'immagine, ma richiede un maggior utilizzo della CPU.
ru: Эта опция включает билинейную интерполяцию – сглаживание. Использует ресурсы процессора более интенсивно.

source: Double vision
es: Doble visión
fr: Vision en double
it: Doppia visione
ru: Двойное отображение

source: When enabled, characters appear twice in the image, overlaid onto each other.
es: Cuando se activa, los caracteres se duplican en la imagen, superpuestos uno sobre el otro.
fr: Quand cette option est activée, les caractères apparaissent en double dans l'image, superposés l'un à l'autre.
it: Quando abilitata, i caratteri appaiono due volte nell'immagine, sovrapposti uno sull'altro.
ru: Когда этот режим включен, символы отображаются дважды, перекрывая друг друга.

source: Add salt and pepper noise
es: Añadir ruido sal y pimienta
fr: Ajouter du bruit en sel et poivre
it: Aggiungi disturbo sale e pepe
ru: Добавление точек

source: This option adds randomly colored point noise.
es: Esta opción añade ruido como puntos coloreados aleatorios.
fr: Cette option ajoute des points colorés au hasard dans l'image.
it: Questa opzione aggiunge un disturbo di punti colorati casuali.
ru: Эта опция добавляет хаотично окрашенные точки.

source: Add line noise
es: Añadir líneas de ruido
fr: Ajouter du bruit de lignes
it: Aggiungi disturbo linea
ru: Добавление линий

source: This option enables lines randomly drawn on top of the text code.
es: Esta opción activa el dibujo de lineas aleatorias sobre el código de texto.
fr: Cette option dessine aléatoirement des lignes sur le code textuel.
it: Questa opzione abilita il disegno casuale di linee sopra il codice testo.
ru: Эта опция добавляет хаотичные линий поверх текстового кода.

source: Noise level
es: Nivel de ruido
fr: Niveau de bruit
it: Livello disturbo
ru: Уровень шума

source: The image CAPTCHA module works best with a TrueType font file (TTF) for generating the images, but because of licencing issues it is not allowed to package fonts with the module. A simple built-in bitmap font is provided as default instead. You can install TrueType fonts yourself by putting them in the fonts directory of the image CAPTCHA module (directory "%fontsdir") or by uploading them to your Drupal file system (directory "%filesdir") with for example the upload module.
es: El módulo image CAPTCHA trabaja mejor con un fichero de fuente TrueType (TTF) para generar las imágenes, pero por razones de licencia no está permitido empaquetar fuentes con el módulo. Se proporciona sin embargo una fuente incrustada simple de bitmap como defecto. Usted mismo puede instalar fuentes TrueType poniéndolas en el directorio de fuentes del módulo image CAPTCHA (directorio "%fontsdir") o cargándolas en el sistema de ficheros Drupal (directorio "%filesdir") con el módulo upload, por ejemplo.
fr: Le module Image CAPTCHA fonctionne mieux avec un fichier de police TrueType (TTF) pour générer les images, mais en raison de problèmes de licence, il n'est pas permis de distribuer les polices avec le module. Une simple police "bitmap" est fournie par défaut à la place. Vous pouvez installer les polices TrueType vous-même en les plaçant dans le répertoire de polices du module Image CAPTCHA (répertoire "%fontsdir") ou en les téléchargeant dans votre système de fichiers Drupal (répertoire "%filesdir"), à l'aide du module Upload par exemple.
it: Il modulo 'image CAPTCHA' funziona al meglio con file che utilizzano caratteri TrueType (TTF) per la generazione delle immagini, ma per problemi di licenza non è consentito includere questi caratteri all'interno del modulo. Un carattere bitmap viene fornito a titolo di esempio. Puoi installare i caratteri TrueType autonomamente ponendoli nella cartella dei caratteri nel modulo 'image CAPTCHA' (cartella "%fontsdir") oppure caricandoli nel tuo file system di Drupal (cartella "%filesdir") utilizzando, per esempio, il modulo 'upload'.
ru: Субмодуль CAPTCHA, реализующий графические задачи, работает лучше (на генерации изображений), если в нем используются шрифты TrueType (TTF), но лицензионные ограничения не позволяют распространять такие шрифты совместно с модулем. Поэтому по умолчанию вместо них используются простые встроенные растровые шрифты. Вы можете самостоятельно установить TrueType шрифты посредством помещения их в соответствующий каталог модуля CAPTCHA (каталог "%fontsdir") или загрузив их в файловую систему Drupal (каталог "%filesdir").

source: The usage of the built-in bitmap font it is not recommended because of its small size and missing UTF-8 support.
es: El uso de la fuente bitmap incrustada no se recomienda porque es de un tamaño demasiado pequeño y carece de soporte UTF-8.
fr: L'utilisation de la police intégrée en "bitmap" n'est pas recommandée car elle est très petite et ne supporte pas les caractères UTF-8.
it: L'utilizzo del carattere bitmap incorporato non è consigliato a causa delle sue piccole dimensioni e per la mancanza del supporto UTF-8.
ru: Использование встроенных растровых шрифтов не рекомендуется, потому, что они имеют маленький размер и не поддерживают UTF-8.

source: The list of characters to use should not contain spaces.
es: La lista de caracteres para usar no debería contener espacios.
fr: La liste de caractères pouvant être utilisée ne devrait pas contenir des espaces.
it: L'elenco di caratteri usati non dovrebbe contenere spazi.
ru: Список используемых символов не должен содержать пробелы.

source: You need to select a font
es: Tiene que seleccionar una fuente
fr: Vous devez sélectionner une police
it: Devi selezionare un font
ru: Вы должны выбрать шрифт

source: Font does not exist or is not readable.
es: La fuente no existe o no es legible.
fr: La police sélectionnée n'existe pas ou n'est pas lisible.
it: Font inesistente o non leggibile.
ru: Шрифт не существует или не читаем.

source: Encountered an illegal byte while splitting an utf8 string in characters.
es: Se ha encontrado un byte ilegal cuando se separaba una cadena UTF-8 en caracteres.
fr: Un octet illégal a été rencontré alors qu'une chaîne de caractères utf8 était divisée.
it: E' stato incontrato un byte illegate mentre si stava dividendo una stringa utf8 in caratteri.
ru: Обнаружен недопустимый байт при посимвольном разложении строки (в кодировке utf8).

source: What code is in the image?
es: ¿Qué código hay en la imagen?
fr: Quel code textuel se trouve dans cette image?
it: Qual è il codice nell'immagine?
ru: Какой код на картинке?

source: Copy the characters (respecting upper/lower case) from the image.
es: Copie los caracteres (respetando mayúsculas y minúsculas) de la imagen.
fr: Copier les caractères de l'image (en respectant les majuscules/minuscules).
it: Copia i caratteri (rispettando minuscole e maiuscole) dall'immagine.
ru: Перепишите символы с картинки (соблюдая верхний / нижний регистр).

source: Generation of image CAPTCHA failed. Check your image CAPTCHA configuration and especially the used font.
es: Ha fallado la generación del CAPTCHA imagen. Compruebe la configuración de su CAPTCHA imagen, especialmente la fuente usada.
fr: La génération de l'image CAPTCHA a échoué. Vérifiez la configuration de votre image CAPTCHA, en particulier la police de caractères utilisée.
it: Generazione dell'immagine captcha fallita. Controllare le impostazioni dell'immagine captcha e soprattutto il font usato.
ru: Генерация CAPTCHA-изображения завершилась неудачно. Проверьте настройки CAPTCHA-изображений, а в особенности используемый шрифт.

source: No FreeType support
es: No hay soporte FreeType
fr: FreeType n'est pas supporté
it: Nessun supporto a FreeType
ru: Нет поддержки FreeType

source: FreeType support is required for working with TrueType fonts (.ttf), but the GD library for PHP does not support it.
es: El soporte FreeType es necesario para trabajar con fuentes TrueType (.ttf), pero la librería GD para PHP no lo soporta.
fr: FreeType est requis afin de travailler avec des polices TrueType (.ttf). Or, la librairie GD installée ne supporte pas FreeType.
it: Il supporto a FreeType è richiesto per il funzionamento con caratteri TrueType (.ttf), ma la libreria GD per PHP non lo supporta.
ru: Требуется поддержка FreeType для работы с TrueType шрифтами (.ttf), но библиотека GD для PHP не поддерживает это.

source: No GD library
es: No hay librería GD
fr: Pas de librairie GD
it: Libreria GD assente
ru: Нет библиотеки GD

source: The GD library for PHP is missing or outdated. Please check the <a href="@url">PHP image documentation</a> for information on how to correct this.
es: La librería GD para PHP no está presente o está anticuada. Por favor, compruebe la <a href="@url">documetanción de imagenes en PHP</a> para informarse sobre cómo corregirlo.
fr: Le librairie GD pour PHP est manquante ou périmée. Veuillez vous référer à la <a href="@url">documentation PHP pour les images</a> pour des informations sur la façon de corriger ce problème.
it: La libreria GD per PHP è mancante o datata. Controlla la <a href="@url">Documentazione immagini per PHP</a> per ulteriori informazioni sulla correzione del problema.
ru: Библиотека GD для PHP недоступна или устарела. Пожалуйста посмотрите документацию по PHP изображениям для получения большей информации о том как можно исправить данную ошибку – <a href="@url">PHP image documentation</a>.

source: Provides an image based CAPTCHA.
es: Porporciona un CAPTCHA basado en imagen.
fr: Fournit un CAPTCHA image.
it: Fornisce un'immagine basata su CAPTCHA.
ru: Субмодуль CAPTCHA, реализующий графические задачи.

source: In this challenge the visitor is asked for the n<sup>th</sup> word of a given phrase.
es: En este reto, se pregunta al visitante por la enésima palabra de una frase dada.
fr: Dans ce défi, on demande au visiteur d'écrire le n<sup>ème</sup> mot dans une phrase.
ru: В этой задаче пользователю предлагается записать N-ое слово из предоставленной фразы.

source: Text CAPTCHA
es: CAPTCHA texto
fr: CAPTCHA texte
it: CAPTCHA testuale
ru: Текстовые задачи

source: Kind of words to use in the phrase
es: Tipo de palabras para usare n la frase
fr: Type de mots à utiliser dans la phrase
it: Tipi di parole da utilizzare nella frase
ru: Вид слов, используемых во фразе

source: Generate nonsense random words.
es: Generar palabras aleatorias sin sentido.
fr: Générer des mots aléatoires (mélanges de lettres).
it: Genera parole random senza senso.
ru: Генерировать бессмысленные слова.

source: Use user defined words.
es: Usar palabras definidas por el usuario.
fr: Piger des mots dans une liste.
it: Usa parole definite dall'utente.
ru: Использовать собственные слова.

source: User defined words
es: Palabras definidas por el usuario.
fr: Liste de mots
it: Usa parole definite
ru: Собственные слова.

source: Enter a bunch of space separated words (at least @min).
es: Entre unas cuantas de palabras separadas por espacio (al menos @min).
fr: Entrer une liste de mots séparés par des espaces (au moint @min mots).
it: Inserire uno spazio per separare le parole (almeno @min).
ru: Введите слова, разделенные пробелами (не менее @min).

source: Number of words in the phrase
es: Número de palabras en la frase
fr: Nombre de mots dans la phrase
it: Numero di parole nella frase
ru: Количество слов во фразе

source: You need to enter at least @min words if you want to use user defined words.
es: Tiene que entrar al menos @min palabras si quiere usar palabras definidas por el usuario.
fr: Vous devez entrer au moint @min mots si vous souhaitez piger parmis une liste de mots.
it: E' necessario inserire almeno @min parole se vuoi usare delle parole definite dall'utente.
ru: Вы должны ввести не менее @min слов, если хотите использовать собственные слова.

source: Number of words in the phrase should be between 4 and 10.
es: El número de palabras en la frase debería estar entre 4 y 10.
fr: Le nombre de mots dans la phrase doit être entre 4 et 10.
it: Il numero di parole nella frase deve essere compreso tra 4 e 10.
ru: Значение количества слов во фразе должно быть в интервале от 4 до 10.

source: first
es: primera
fr: premier
it: primo
ru: первое

source: second
es: segunda
fr: deuxième
it: secondo
ru: второе

source: third
es: tercera
fr: troisième
it: terzo
ru: третье

source: fourth
es: cuarta
fr: quatrième
it: quarto
ru: четвертое

source: fifth
es: quinta
fr: cinquième
it: quinto
ru: пятое

source: sixth
es: sexta
fr: sixième
it: sesto
ru: шестое

source: seventh
es: séptima
fr: septième
it: settimo
ru: седьмое

source: eighth
es: octava
fr: huitième
it: ottavo
ru: восьмое

source: ninth
es: novena
fr: neuvième
it: nono
ru: девятое

source: tenth
es: décima
fr: dixième
it: decimo
ru: десятое

source: What is the @nth word in the phrase "@words"?
es: ¿Cuál es la @nth<sup>a</sup>palabra en la frase "@words"?
fr: Quel est le @nth mot dans la phrase "@words"?
it: Quale è la @nth parola nella frase "@words"?
ru: Напишите @nth слово из фразы "@words"

source: Provides a simple text based CAPTCHA.
es: Proporciona un CAPTCHA simple basado en texto.
fr: Fournit un CAPTCHA simple basé sur du texte.
it: Fornisce un testo semplice basato su CAPTCHA.
ru: Субмодуль CAPTCHA, реализующий простые текстовые задачи.

source: "CAPTCHA" is an acronym for "Completely Automated Public Turing test to tell Computers and Humans Apart". It is typically a challenge-response test to determine whether the user is human. The CAPTCHA module is a tool to fight automated submission by malicious users (spamming) of for example comments forms, user registration forms, guestbook forms, etc. You can extend the desired forms with an additional challenge, which should be easy for a human to solve correctly, but hard enough to keep automated scripts and spam bots out.
es: "CAPTCHA" es un acrónimo de "Completely Automated Public Turing test to tell Computers and Humans Apart" (test de turing público completamente automatizado para separar ordenadores y humanos). Típicamente es un test de reto-respuesta para determinar si el usuario es humano. El módulo CAPTCHA es una herramienta para luchar contra los envíos automatizados por parte de usuarios maliciosos (spam) de formularios de comentario, registro de usuario, etc. Se pueden extender los formularios deseados con un reto adicional, que debería ser fácil de resolver correctamente para un humano, pero lo suficientemente difícil para mantener alejados a los programas automatizados y los robots de mensajes basura.
fr: "CAPTCHA" est un acronyme pour "Completely Automated Public Turing test to tell Computers and Humans Apart" ("Test de Turing complètement automatisé pour distinguer les ordinateurs des humains". Le module CAPTCHA est un outil pour lutter contre les soumissions automatisées effectuées par des utilisateurs malveillants (spamming). Le module évite la soumission automatisée de formulaires de commentaires, de formulaires d'inscription des utilisateurs, de livre d'or, etc. CAPTCHA vous permet d'ajouter à vos formulaires une question supplémentaire facile à résoudre par un être humain, mais assez difficile pour empêcher des scripts automatisés et les robots collecteurs (bots) de répondre correctement.
it: "CAPTCHA" è l'acronimo di "Completely Automated Public Turing test to tell Computers and Humans Apart". Tipicamente si tratta di un test domanda-risposta per stabilire se l'utente è un umano. Il modulo 'CAPTCHA' è uno strumento per contenere l'inserimento automatizzato da parte di utenti malevoli (spam) in, per esempio, form dei commenti, form di registrazione degli utenti, form del guestbook etc. Puoi ampliare i form desiderati con una domanda supplementare, che potrebbero essere di semplice risoluzione per un umano ma sufficientemente difficile da inibire script automatizzati e bot per lo spam.
