Repository: psoetens/orocos-www
Catalog: drupal/sites/default/modules/captcha/po/*.po
Languages: es, fr, it, ru

source: Location of comment submission form
es: Localización del formulario de envío de comentarios
fr: Localisation du formulaire de soumission de commentaires
it: Posizione del form di inserimento commenti
ru: Расположение комментария формы отправки

source: Display on separate page
es: Mostrar en una página aparte
fr: Afficher sur une page séparée
it: Mostra in una pagina separata
ru: Показывать на отдельной странице

source: CAPTCHA is a trademark of Carnegie Mellon University.
es: CAPTCHA es una marca registrada de Carnegie Mellon University.
fr: CAPTCHA est une marque déposée de Carnegie Mellon University.
it: CAPTCHA è un marchio registrato di Carnegie Mellon University.
ru: CAPTCHA – это торговая марка Carnegie Mellon University.

source: <p>A CAPTCHA can be added to virtually each Drupal form. Some default forms are already provided in the form list, but arbitrary forms can be easily added and managed when the option "%adminlinks" is enabled.</p><p>Users with the "%skipcaptcha" <a href="@perm">permission</a> won't be offered a challenge. Be sure to grant this permission to the trusted users (e.g. site administrators). If you want to test a protected form, be sure to do it as a user without the "%skipcaptcha" permission (e.g. as anonymous user).</p>
es: <p>Se puede añadir un CAPTCHA virtualmente a cualquier formulario Drupal. En la lista de formularios se proveen algunos formularios por defecto, pero se pueden añadir y gestionar fácilmente formularios arbitrarios cuando la opción "%adminlinks" está activada.</p><p>Los usuarios con <a href="@perm">permiso</a> "%skipcaptcha" se saltarán el reto. Asegúrese de activar este permiso a los usuarios de confianza (administradores). Si quiere probar un formulario protegido, asegúrese de hacerlo como un usuario sin el permiso "%skipcaptcha" (por ejemplo, como usuario anónimo).</p>
fr: <p>Un CAPTCHA peut être ajouté à presque chaque formulaire dans Drupal. Certains formulaires sont fournis par défaut dans la liste des formulaires, mais des formulaires peuvent arbitrairement être ajoutés et gérés lorsque l'option "%adminlinks" est activée. </p> <p> Les utilisateurs avec la <a href="@perm"> permission</a> "%skipcaptcha" n'auront pas à répondre aux défis. Veillez à accorder cette permission aux utilisateurs en qui vous avez confiance (par exemple, les administrateurs du site). Si vous voulez tester un formulaire protégé, assurez-vous de le faire en tant qu'utilisateur sans la permission "%skipcaptcha " (par exemple, comme utilisateur anonyme).</p>
it: <p>Un CAPTCHA può essere aggiunto praticamente a ogni form di Drupal. Qualche form predefinito è reso disponibile nella lista form, ma quelli arbitrari possono essere facilmente aggiunti e gestiti quando l'opzione "%adminlinks" è attivata.</p><p>Utenti con il <a href="@perm">permesso</a> "%skipcaptcha" non saranno verificati. Verifica di aver assegnato questo permesso a utenti fidati (come gli amministratori). Se vuoi testare un form protetto, assicurati di farlo come un utente senza i permessi "%skipcaptcha" (per esempio un utente anonimo).</p>
ru: <p>CAPTCHA-задачу можно добавить практически на любую форму Drupal. P.S. Модуль CAPTCHA также «добавляет себя» в раздел «Контроль доступа {ru}» (<a href="@perm">permission</a>).</p><p>Пользователям с разрешением "%skipcaptcha" (<a href="@perm">permission</a>) не будет предложена CAPTCHA-задача (предоставляйте такое разрешение только доверенным пользователям, например, администраторам сайта). Если вы желаете протестировать CAPTCHA-форму (т.е. форуму, в которую была внедрена CAPTCHA-задача), сделайте это под таким пользователем, в правах которого не установлена возможность "%skipcaptcha" (например, в качестве анонимного пользователя).</p>

source: Add CAPTCHA administration links to forms
es: Añade enlaces de administración de CAPTCHA a los formularios
fr: Ajouter des liens d'administration de CAPTCHA aux formulaires
it: Aggiungi link di amministrazione CAPTCHA ai form
ru: Добавить ссылку администрирования CAPTCHA на каждую форму

source: Administer how and where CAPTCHAs are used.
es: Administra cómo y dónde se usan CAPTCHAs.
fr: Administrer comment et où les CAPTCHA sont utilisés
it: Amministra il modo e la posizione in cui vengono usati i CAPTCHA.
ru: Управление тем, как и где будет использоваться CAPTCHA.

source: General settings
es: Configuraciones generales
fr: Configuration générale
it: Impostazioni generali
ru: Общие настройки

source: Examples
es: Ejemplos
fr: Exemples
it: Esempio
ru: Примеры

source: An overview of the available challenge types with examples.
es: Un resumen de los tipos de CAPTCHA disponibles con ejemplos.
fr: Un survol des types de défis disponibles avec des exemples.
it: Una panoramica sui tipi di verifica disponibili, con esempi.
ru: Общий обзор доступных типов задач с примерами.

source: This question is for testing whether you are a human visitor and to prevent automated spam submissions.
es: Esta pregunta es para comprobar que usted es un visitante humano y para impedir los envíos basura automatizados.
fr: Cette question sert à vérifier si vous êtes un visiteur humain afin d'éviter les soumissions automatisées (spam).
it: Questa domanda è per verificare che tu sei un visitatore umano e prevenire iscrizioni automatiche di spam.
ru: Этот вопрос задается для проверки того, не является ли обратная сторона программой-роботом (для предотвращения попыток автоматической регистрации).

source: Disabled CAPTCHA for form %form_id.
es: CAPTCHA para el formulario %form_id desactivado.
fr: CAPTCHA désactivé pour le formulaire %form_id
it: Disabilita CAPTCHA per il form %form_id.
ru: Отключить CAPTCHA для формы %form_id.

source: Deleted CAPTCHA for form %form_id.
es: CAPTCHA para el formulario %form_id eliminado.
fr: CAPTCHA supprimé pour le formulaire %form_id
it: Eliminato CAPTCHA per il form %form_id.
ru: Удалить CAPTCHA для формы %form_id.

source: This option is very helpful to enable/disable challenges on forms. When enabled, users with the "%admincaptcha" permission will see CAPTCHA administration links on all forms (except on administrative pages, which shouldn't be accessible to untrusted users in the first place). These links make it possible to enable a challenge of the desired type or disable it.
es: Esta opción es muy útil para activar/desactivar retos en formularios. Cuando se activa, los usuarios con el permiso "%admincaptcha" verán enlaces de administración de CAPTCHA en todos los formularios (excepto en las páginas de administración, que nunca deberían ser accesibles para usuarios desconocidos). Estos enlaces permiten activar un reto del tipo deseado o desactivarlo.
fr: Cette option est très utile pour activer/désactiver les défis sur les formulaires. Lorsque cette option est activée, les utilisateurs avec la permission "%admincaptcha" verront un lien vers l'administration de CAPTCHA sur tous les formulaires (sauf sur les pages administratives, qui ne devraient pas être accessibles à des utilisateurs non fiables en premier lieu). Ces liens permettent d'activer un défi ou de le désactiver.
it: Quest'opzione è molto d'aiuto per abilitare/disabilitare le verifiche sui form. Quando attivo, gli utenti con i permessi "%admincaptcha" vedranno i link di amministrazione CAPTCHA su tutti i form (tranne sulle pagine di amministrazione, che non dovrebbero essere accessibili agli utenti non fidati). Questi link rendono possibile l'attivazione di una verifica del tipo desiderato o di disabilitarlo.
ru: Эта опция окажется полезной в процессе активизации и деактивизации CAPTCHA-задач на формах. Опция добавляет административную ссылку на каждую форму (форма будет видна только тем пользователям, у которых имеется разрешение "%admincaptcha").

source: Challenge type per form
es: Tipo de reto por formulario
fr: Type de défi par formulaire
it: Tipo di verifica per form
ru: Задачи на формах

source: Select the challenge type you want for each of the listed forms (identified by their so called <em>form_id</em>'s). You can easily add arbitrary forms with the help of the '%CAPTCHA_admin_links' option.
es: Seleccione el tipo de reto que quiere para cada uno de los formularios listados (identificados por su <em>form_id</em>). Usted puede fácilmente añadir formularios arbitrarios con la ayuda de la opción'%CAPTCHA_admin_links'.
fr: Sélectionnez le type de défi que vous souhaitez pour chacun des formulaires (identifiés par leur <em>form_id</em>). Vous pouvez facilement ajouter un formulaire à l'aide de l'option '%CAPTCHA_admin_links'.
it: Seleziona il tipo di verifica che vuoi mostrare per ognuno dei form elencati (identificati dai loro cosiddetti <em>form_id</em>). Puoi facilmente aggiungere form arbitrari con l'aiuto dell'opzione '%CAPTCHA_admin_links' .
ru: Выберите тип задачи, который вы хотели бы применить к каждой перечисленной форме (идентифицированной по <em>form_id</em>). Вы можете легко добавить произвольную форму при помощи опции '%CAPTCHA_admin_links'.

source: delete
es: borrar
fr: supprimer
it: elimina
ru: удалить

source: Challenge description
es: Descripción del reto
fr: Description du défi
it: Descrizione della verifica
ru: описание задачи

source: With this description you can explain the purpose of the challenge to the user.
es: Con esta descripción puede usted explicar el propósito del reto al usuario.
fr: Avec cette description, vous pouvez expliquer à l'utilisateur pour quelle raison on lui demande de répondre à un défi.
it: Con questa descrizione puoi spiegare all'utente il fine della verifica.
ru: Этим описанием вы можете разъяснить пользователю необходимость подобных задач.

source: For language %lang_name (code %lang_code)
es: Para el lenguaje %lang_name (código %lang_code)
fr: Pour la langue %lang_name (code %lang_code)
it: Per lingua %lang_name (codice %lang_code)
ru: Для языка %lang_name {%lang_code}

source: Persistence
es: Persistencia
it: Persistenza
ru: Постоянство

source: Always add a challenge.
es: Siempre añadir un reto.
fr: Toujours ajouter un défi
it: Aggiungi sempre una verifica.
ru: Добавлять задачу всегда.

source: Omit challenges for a form once the user has successfully responded to a challenge for that form.
es: Omitir retos en un formulario una vez que el usuario haya respondido con éxito a un reto en ese formulario.
fr: Omettre les défis dans un formulaire une fois que l'utilisateur a répondu avec succès à une question pour ce formulaire.
it: Omette la verifica di un form una volta che l'utente ha risposto con successo all verifica di quel form.
ru: Отключить задачи <u>на форме</u>, после того как пользователь однократно и успешно решил задачу.

source: Omit challenges for all forms once the user has successfully responded to a challenge.
es: Omitir retos en todos los formularios una vez que el usuario haya respondido a un reto.
fr: Omettre les défis dans tous les formulaires une fois que l'utilisateur a répondu avec succès à une question pour un formulaire.
it: Omette verifiche per tutti i form una volta che l'utente ha risposto a una verifica.
ru: Отключить задачи <u>на всех формах</u>, после того как пользователь однократно и успешно решил задачу.

source: Define if challenges should be omitted during the rest of a session once the user successfully responses to a challenge.
es: Define si los retos deberían ser omitidos durante el resto de la sesión una vez que el usuario haya respondido con éxito a un reto.
fr: Définit si les défis doivent être omis durant le reste de la session une fois que l'utilisateur a répondu avec succès à une question pour un formulaire.
it: Definisce se le verifiche dovrebbero essere omesse durante il resto di una sessione una volta che l'utente ha risposto correttamente alla verifica.
ru: Определяет, может ли пользователь пропускать новые задачи <u>в текущей сессии</u>, если ранее он успешно решил capcha-задачу.

source: Log wrong responses
es: Registrar respuestas incorrectas
fr: Enregistrer les mauvaises réponses
it: Memorizza nel log le risposte sbagliate.
ru: Регистрировать неправильные ответы

source: Report information about wrong responses to the !watchdoglog.
es: Registrar información sobre respuestas erróneas al !watchdoglog.
fr: Émettre un rapport d'information sur les mauvaises réponses dans le !watchdoglog.
it: Rapporto sulle informazioni riguardo le risposte sbagliate nel !watchdoglog.
ru: Заносить информацию о неправильных ответах в !watchdoglog.

source: Submit
es: Enviar
fr: Soumettre
it: Invia
ru: Отправить

source: Challenge type (module)
es: Tipo de reto (modulo)
fr: Type de défi (module)
it: Tipo di domanda (modulo)
ru: Тип задачи (модуль)

source: Operations
es: Operaciones
fr: Opérations
it: Operazioni
ru: Операции

source: The CAPTCHA settings were saved.
es: Las configuraciones de CAPTCHA han sido guardadas.
fr: Les paramètres de CAPTCHA ont été sauvegardés.
it: Le impostazioni CAPTCHA sono state salvate.
ru: Настройки CAPTCHA были сохранены.

source: Select the challenge for @form_id
es: Seleccionar el reto para @form_id
fr: Sélectionner le défi pour @form_id
it: Scegli la domanda per @form_id
ru: Выберите задачу для @form_id

source: Cancel
es: Cancelar
fr: Annuler
it: Annulla
ru: Отменить

source: Unavailable form_id %form_id
es: Form_id %form_id no disponible
fr: Le form_id %form_id n'est pas disponible
it: Form_id %form_id non disponibile
ru: Недоступен form_id %form_id

source: Saved CAPTCHA settings.
es: Se guardaron las configuraciones de CAPTCHA.
fr: Paramètres de CAPTCHA sauvegardés.
it: Impostazioni CAPTCHA salvate.
ru: Сохраненные CAPTCHA настройки.

source: CAPTCHA problem: hook_captcha() of module %module returned nothing when trying to retrieve challenge type %type for form %form_id.
es: Problema en CAPTCHA: hook_captcha() del módulo %module no devolvió nada cuando intentaba recuperar el tipo de reto %type para el formulario %form_id.
fr: Problème avec CAPTCHA: hook_captcha() du module %module a retourné un message vide lors de la recherche du défi de type %type pour le formulaire %form_id.
it: Problema di CAPTCHA: hook_captcha() del modulo %module non ha restituito nulla mentre provava a recuperare il tipo di domanda %type per il form %form_id.
ru: Проблема CAPTCHA: hook_captcha() модуля %module ничего не возвращает когда происходит попытка извлечения задачи типа %type для формы %form_id.

source: The challenge "@type" (by module "@module") is enabled here for untrusted users: !edit, !disable or !general.
es: El reto "@type" (por el módulo "@module") está activado aquí para usuarios no fiables: !edit, !disable or !general.
fr: Le défi "@type" (par le module "@module") est activé sur cette page pour les usagers non sécurisés: !edit, !disable ou !general
ru: Задача типа "@type" (из модуля "@module") включена здесь для недоверенных пользователей: !edit, !disable or !general.

source: edit challenge type
es: editar tipo de reto
fr: éditer le type de défi
ru: редактировать тип задачи

source: disable challenge
es: desactivar reto
fr: désactiver le défio
ru: отключить задачу

source: edit general challenge settings
es: editar configuraciones generales de retos
fr: éditer les paramètres généraux des défis
ru: редактировать общие настройки задач

source: Place a challenge here for untrusted users.
es: Situar aquí un reto para usuarios no fiables.
fr: Ajouter un défi sur cette page pour les usagers non sécurisés.
ru: Здесь место задачи для недоверенных пользователей.

source: Cookies should be enabled in your browser for CAPTCHA validation.
es: Las cookies deberían estar activadas en su navegador para la validación de CAPTCHA.
fr: Les cookies doivent être activés dans votre navigateur pour la validation des CAPTCHA.
ru: Для проверки CAPTCHA в вашем браузере должны быть включены cookies.

source: Invalid CAPTCHA token.
es: Token CAPTCHA inválido.
fr: Ticket CAPTCHA invalide
it: Token CAPTCHA non valido.
ru: Неправильный CAPTCHA-символ.

source: The answer you entered for the CAPTCHA was not correct.
es: Su respuesta al CAPTCHA no es correcta.
fr: La réponse que vous avez entré pour le CAPTCHA est incorrecte.
it: La risposta inserita per il CAPTCHA non era corretta.
ru: Вы ввели неправильный CAPTCHA-ответ.

source: %form_id post blocked by CAPTCHA module: challenge "%challenge" (by module "%module"), user answered "%response", but the solution was "%solution".
es: Envío %form_id bloquado por el módulo CAPTCHA: reto "%challenge" (por el módulo "%module"), el usuario respondió "%response", pero la solución era "%solution".
fr: La soumission du formulaire %form_id a été bloquée par le module CAPTCHA: au défi "%challenge" (du module "%module"), l'usager a répondu "%response", mais la solution était "%solution".
it: Il contenuto %form_id è stato bloccato dal modulo 'CAPTCHA': alla domanda "%challenge" (del modulo "%module") l'utente ha risposto "%response" ma la soluzione era "%solution".
ru: Отправка формы %form_id заблокирована модулем CAPTCHA: задача "%challenge" (из модуля "%module"); пользователь ответил "%response", но решение было "%solution".

source: You can't request more than @num challenges without solving them. Your previous challenges were flushed.
es: No puede pedir más de @num retos sin resolverlos. Sus retos previos fueron limpiados.
fr: ous ne pouvez pas demander plus de @num défis sans les résoudre. Vos défis précédents ont été effacés.
ru: Вы не можете запрашивать более @num задач без их решения. Ваши предыдущие задачи были сброшены.

source: This page gives an overview of all available challenge types, generated with their current settings.
es: Esta página da una visión general de los tipos de reto disponibles, generados con sus configuraciones actuales.
fr: Cette page donne un aperçu de tous les types de défi, générés avec leurs paramètres actuels.
it: Questa pagina offre una panoramica di tutti i tipi di domande disponibili, generata con le loro impostazioni correnti.
ru: Эта страница содержит примеры задач всех доступных типов, созданных на основе текущих настроек.

source: Challenge "%challenge" by module "%module"
es: Reto "%challenge" por el módulo "%module"
fr: Le défi "%challenge" par le module "%module"
it: Richiesta "%challenge" dal modulo "%module"
ru: Задача "%challenge" из модуля "%module"

source: 10 more examples of this challenge.
es: 10 ejemplos más de este reto.
fr: 10 autres exemples de ce défi.
it: Altri 10 esempi di questa domanda.
ru: еще 10 примеров такой задачи.

source: Math Question
es: Pregunta matemática
fr: Question mathématique
it: Problema Matematico
ru: Математический вопрос

source: Solve this simple math problem and enter the result. E.g. for 1+3, enter 4.
es: Resuelva este problema matemático simple y entre el resultado. Para 1-3, entre 4.
fr: Veuillez résoudre ce simple problème mathématique et entrer le résultat. E.g. pour 1+3, entrez 4.
it: Risolvere questo semplice problema matematico e inserire il risultato. Es.: per 1+3, inserire 4.
ru: Решите эту элементарную математическую задачу. Например, если «1+3=», то введите 4.

source: Already @counter blocked form submissions
fr: @counter soumissions de formulaires ont été bloqués jusqu'à présent
it: Sono già stati bloccati @counter inserimenti di form
ru: Заблокировано следующее количество отправленных форм: @counter

source: administer CAPTCHA settings
es: administrar configuración de CAPTCHA
it: amministrare le impostazioni di CAPTCHA
ru: управлять настройками CAPTCHA

source: skip CAPTCHA
es: saltar CAPTCHA
it: eludere CAPTCHA
ru: пропускать CAPTCHA

source: Unsupported database.
es: Base de datos no soportada.
fr: Cette base de données n'est pas prise en charge.
it: Database non supportato.
ru: Не поддерживаемая база данных.

source: The installation of the captcha_points table and some default entries was successful
es: La instalación de la tabla captcha_points y algunas entradas por defecto fue exitosa.
fr: L'installation de la table captcha_points et quelques éléments supplémentaires (défaut) a été réalisée avec succès
ru: Установка таблицы captcha_points и некоторых «записей по умолчанию» прошла успешно

source: The installation of the CAPTCHA module failed
es: Ha fallado la instalación del módulo CAPTCHA
fr: L'installation du module CAPTCHA a échoué
ru: Установка модуля CAPTCHA потерпела неудачу

source: Base CAPTCHA module for adding challenges to arbitrary forms.
es: Módulo base CAPTCHA para añadir retos a formularios arbitrarios.
fr: Module CAPTCHA de base permettant d'ajouter arbitrairement des questions (défis) à des formulaires.
it: Il modulo 'CAPTCHA' base per l'aggiunta di domande a form arbitrari.
ru: Базовый модуль CAPTCHA для добавления задач в произвольные формы.

source: Spam control
fr: Control du spam
it: Controllo spam
ru: Спам контроль

source: The image CAPTCHA is a popular challenge where a random textual code is obfuscated in an image. The image is generated on the fly for each request, which is rather CPU intensive for the server. Be careful with the size and computation related settings.
es: El CAPTCHA imagen es un reto popular donde un código textual aleatorio se ofusca en una imagen. La imagen se genera al vuelo para cada petición, lo cuál consume tiempo de CPU en el servidor. Sea cuidadoso con el tamaño y las configuraciones relacionadas con la computación.
fr: Le CAPTCHA image est un défi populaire où un code textuel aléatoire est affiché dans une image. L'image est générée à la volée pour chaque demande, ce qui demande beaucoup de ressources processeur au serveur. Attention à la taille et aux paramètres de calcul.
it: L'immagine CAPTCHA è una domanda diffusa dove un codice testuale casuale è offuscato all'interno di una immagine. L'immagine è generata al volo per ogni richiesta, risultando piuttosto faticoso per la CPU del server. Poni attenzione all'entità e alle impostazioni relative al calcolo.
ru: Графическая CAPTCHA задача - это популярное решение в котором текстовый код показан в виде графического изображения. Изображение создается «на лету» на каждый запрос, что оказывает дополнительную нагрузку на серверный процессор. Будьте внимательны с размерами изображения и другими настройками.

source: <p>Example image, generated with the current settings:</p>!img
es: <p>Imagen de ejemplo, generada con las configuraciones actuales:</p>!img
fr: <p>Exemple d'image, générée avec les paramètres actuels:</p>!img
it: <p>Immagine di esempio, generata con le impostazioni correnti:</p>!img
ru: <p>Пример изображения, созданного на основе текущих настроек:</p>!img

source: Image CAPTCHA
es: CAPTCHA imagen
fr: CAPTCHA image
it: Immagine 'CAPTCHA'
ru: Графические задачи

source: Could not find or read the configured font "%font" for the image captcha.
es: No se pudo encontrar o leer la fuente "%font" configurada para el CAPTCHA imagen.
fr: Impossible de trouver ou de lire la police de caractère "%font" configurée pour le CAPTCHA image.
ru: Не удалось найти или прочитать настроенный шрифт "%font" для графических задач.

source: Built-in font
es: Fuente predefinida
fr: Police intégrée
it: Carattere incorporato
ru: Встроенный шрифт

source: Images cannot be generated, because your PHP installation's GD library has no JPEG support.
es: las imágenes no se pueden generar, pues la librería GD de su instalación de PHP no tiene soporte para JPEG.
fr: Les images n'ont pas pu être générées car la librairie GD installée ne supporte pas les JPEG.
it: Le immagini non possono essere generate perché le librerie GD della tua installazione PHP non possiedono il supporto JPEG.
ru: Изображение не может быть сгенерировано, потому что библиотека GD не имеет поддержки JPEG.

source: Code settings
es: Configuración del código
fr: Paramètres du code
it: Impostazioni del codice
ru: Настройки кода

source: Characters to use in the code
es: Caracteres para usar en el código
fr: Caractères à utiliser dans le code
it: Caratteri da usare nel codice
ru: Символы, используемые в коде
